import React, { Component } from 'react'
import {author_name_label} from '../contents/control-text.js'
import {parseItalic} from '../actions/parse-text.js'

class Home extends Component {
  styles = {
    middleImg: {position: 'relative',
              top: -4},
    bottomImg: {position: 'relative',
              top: -25},
  }
  render() {
    const props = this.props
    const lang = props.lang
    return (
      <div>
        <img src={require('../img/home-1.png')} alt="icon_title" className="fit shim-right" />
        <img style={this.styles.middleImg} src={require('../img/home-2.png')} alt="icon_title" className="fit shim-left"  />
        <img style={this.styles.bottomImg} src={require('../img/home-3.png')} alt="icon_series_num" className="fit shim-left" />
      </div>
    );
  }
}
const appBarOffsetTop = {}

const c0 = (lang) => {
    const styles = {
      appBarOffsetTop,
      middleImg: {position: 'relative',
                top: -4},
      bottomImg: {position: 'relative',
                top: -25},
    }
    return (
      <div>
        <img src={require('../img/c10.png')} alt="icon_title" />
        <img style={styles.middleImg} src={require('../img/c11.png')} alt="icon_title" className="fit shim-left"  />
        <img style={styles.bottomImg} src={require('../img/c12.png')} alt="icon_series_num" className="fit shim-left" />
      </div>
    )
}
const a0 = (lang) => {
    const styles = {
      appBarOffsetTop,
      middleImg: {position: 'relative',
                top: -4},
      bottomImg: {position: 'relative',
                top: -25},
    }
    return (
      <div>
        <img src={require('../img/a10.png')} alt="icon_title" />
        <img style={styles.middleImg} src={require('../img/a11.png')} alt="icon_title" className="fit shim-left"  />
        <img style={styles.bottomImg} src={require('../img/a12.png')} alt="icon_series_num" className="fit shim-left" />
      </div>
    )
}

const oldP0 = (lang) => {
    const styles = {
      appBarOffsetTop,
      middleImg: {position: 'relative',
                top: -4},
      bottomImg: {position: 'relative',
                top: -25},
    }
    return (
      <div>
        <img src={require('../img/home-1.png')} alt="icon_title" className="fit shim-right" />
        <img style={styles.middleImg} src={require('../img/home-2.png')} alt="icon_title" className="fit shim-left"  />
        <p className="frontPageFiller"><span></span></p>
        <img style={styles.bottomImg} src={require('../img/home-3.png')} alt="icon_series_num" className="fit shim-left" />
        <div>
        <img style={styles.middleImg} src={require('../img/author-screen.png')} alt="original_icon" />
        <div style={{fontSize:19}}>{author_name_label[lang]}</div>
        </div>
      </div>
    )
}

const intro_zh = (
<section>
<article>
<div style={{overflowX: 'hidden'}}>
          大家一定很奇怪，二十世紀科技昌明的時代，我為什麼要和大家談鬼說怪，聖人如孔子也不談怪力亂神，何況在這麼黑暗的夜晚來說鬼，不是聳人聽聞，非常不當嗎?
            <br/>
            一談到鬼，我們腦海中馬上浮起鬼披頭散發、青面獠牙的可怕樣子，其實鬼並不可怕。鬼不但不可怕，有一些鬼還很可愛。
            <br/>
            好比動物裡面有一些像獅子、老虎、犀牛等可怕的猛獸，但是也有像兔子、麋鹿、貓、狗之類討人喜歡的可愛動物。同樣的，鬼有可怕的惡鬼、厲鬼，但是也有可愛的好鬼、善鬼。
            <br/>
            各位並且可以發現鬼不只在荒郊墓塚裡，鬼也在我們的身邊附近。例如我們常常聽到很多的太太談到他的先生時，總是嬌嗔地說：“我們家那個死鬼呀!
            <br/>
            ……”提到自己乖巧的兒子、女兒時，也會很得意地說：“我那個小鬼呀!……”可見鬼並不可怕，有時候還很可愛，鬼與我們非常靠近。
            <br/>
        　　中國人的民族性宗教信仰的性格很淡，中國人不但不相信鬼的存在，並且喜歡破壞鬼。佛教雖然不主張崇拜鬼，但是卻承認鬼的存在，佛教認為鬼是六道眾生之一。
            <br/>
            有許多人不承認鬼的存在，並且刻意去破壞鬼的形象，常常自豪地說：“哼!我才不相信有什麼鬼呢!”
            <br/>
    我們否定鬼的存在，難道就能消滅鬼道確實存在的真像了嗎?在世界上任何一個科學昌明的國家，都承認鬼的存在，像美國的白宮，林肯的鬼魂經常在那兒出沒，這在美國已經是婦孺皆曉的事了。
            <br/>
    美國商業部觀光局曾經編印一本觀光手冊，書內報導自從一八○○年以來，全美國各地有名的鬼屋，以及和鬼的傳說有關的屋子，一共有二十九間之多，這件事，國內的聯合報還曾經刊載過。
            <br/>
        　　在台灣我也曾經參觀過兩間鬼經常出現的房子，一棟在嘉義民雄附近，是一座很富麗堂皇的花園洋房，長久以來竟然沒有人居住，聽說那兒常常鬧鬼。另外一棟在台北市仁愛路警察局第四分局的附近，至今大門深鎖，沒有人敢住，聽說鬼也經常在那兒出入。
            <br/>
        　　鬼是否存在於這個世間，我們不必非去否定破壞不可。好比這個世間，除了人類能夠生存之外，還有其他的飛禽走獸生活其間，雖然和我們不同類，但是不也把人間點綴得五彩繽紛嗎?有一些鬼的存在，也能增加人間的熱鬧，有什麼不好呢?況且堂堂的人類，連並不妨礙我們生存的鬼道都不能包容他，不承認他的存在，那麼，人類的度量不是顯得太狹小了嗎?人類晝夜可以自由工作活動，鬼也只不過深夜才出來走動，彼此互不相犯，不也其樂融融嗎?
            <br/>
        　　二十五史的晉書裡，記載一位名叫阮瞻，字千里的讀書人，他雖然飽讀詩書，但是堅持不相信有鬼的存在。有一天夜裡，一位文質彬彬的客人來拜訪他，客人的口才很好，辯說無礙。兩人相談甚歡，慢慢地就談到有沒有鬼存在這件事情上來，阮千里一臉不信的神情說：“哼!我就是不相信有鬼的存在，兄台怎麼也和一些村夫漁婦一般迷信?”
            <br/>
        　　客人再三舉例說明，婉轉地告訴阮千里要相信確實有鬼道眾生，但是任憑客人如何巧說，阮千里還是執著不信地說：“總之，我沒有親眼看見是絕對不會相信的。”
            <br/>
        　　這時客人終於變色說“古來多少聖賢都認為有鬼的存在，你竟然一再不能相信，我告訴你，我就是鬼!”
            <br/>
        　　客人說完之後，突然轉身一變，變成面目猙獰的鬼，阮千里一看大驚失色，這一驚嚇就嚇出病來，不到一年就死了。大家聽了這段話，不知道相信不相信有鬼?各位可以測驗自己，假如在三更半夜的時候，突然有一位白衣秀士，或者是窈窕淑女來拜訪你，不知道各位是否有膽量和他談天說地?
            <br/>
        　　一般人有一個錯誤的觀念，以為人死了一定會變成鬼，看到死人就覺得很恐懼，生怕鬼魂會附上身來。尤其做兒女的，父母去世了，總以祭鬼的儀式來悼拜、超度自己的父母，問他為什麼如此?對方會振振有詞地回答說：因為我先人過亡就要做鬼，墮到地獄去受苦，因此要如此地祭拜他。這種想法實在大為不孝，為什麼不認為我們的祖先也許上生天國，甚至往生極樂世界，為什麼把自己敬重的祖先判刑入地獄去當餓鬼，然後才來超薦他們呢?佛教雖然承認鬼的存在，但是佛教認為人死了之後卻不一定變成人見人怕的鬼。人離開了這個世界，他前往的地方，不僅僅是地獄而已，也許到天堂去享樂，也許再降生為人，縱然輪迴為鬼，也必須具備成為鬼的罪惡因果，才會得到鬼道的報應。我們怎麼忍心將自己的祖先當成惡鬼一般可怕的對象呢?何況鬼也不見得都會找人的麻煩，甚至加害人類，鬼實在沒有我們所想像的那麼恐怖與邪惡。下面我們就來探討鬼的真正形象。
        </div>
      </article>
    </section>
)
const intro_zh_Orig = (
  <section>
    <article>
    大家一定很奇怪，二十世紀科技昌明的時代，我為什麼要和大家談鬼說怪，聖人如孔子也不談怪力亂神，何況在這麼黑暗的夜晚來說鬼，不是聳人聽聞，非常不當嗎？一談到鬼，我們腦海中馬上浮起鬼披頭散發、青面獠牙的可怕樣子，其實鬼並不可怕。鬼不但不可怕，有一些鬼還很可愛。好比動物裡面有一些像獅子、老虎、犀牛等可怕的猛獸，但是也有像兔子、麋鹿、貓、狗之類討人喜歡的可愛動物。同樣的，鬼有可怕的惡鬼、厲鬼，但是也有可愛的好鬼、善鬼。各位並且可以發現鬼不只在荒郊墓塚裡，鬼也在我們的身邊附近。例如我們常常聽到很多的太太談到他的先生時，總是嬌嗔地說：“我們家那個死鬼呀！……”提到自己乖巧的兒子、女兒時，也會很得意地說：“我那個小鬼呀！……”可見鬼並不可怕，有時候還很可愛，鬼與我們非常靠近。
  中國人的民族性宗教信仰的性格很淡，中國人不但不相信鬼的存在，並且喜歡破壞鬼。佛教雖然不主張崇拜鬼，但是卻承認鬼的存在，佛教認為鬼是六道眾生之一。有許多人不承認鬼的存在，並且刻意去破壞鬼的形象，常常自豪地說：“哼！我才不相信有什麼鬼呢！”
  我們否定鬼的存在，難道就能消滅鬼道確實存在的真像了嗎？在世界上任何一個科學昌明的國家，都承認鬼的存在，像美國的白宮，林肯的鬼魂經常在那兒出沒，這在美國已經是婦孺皆曉的事了。美國商業部觀光局曾經編印一本觀光手冊，書內報導自從一八○○年以來，全美國各地有名的鬼屋，以及和鬼的傳說有關的屋子，一共有二十九間之多，這件事，國內的聯合報還曾經刊載過。
  在台灣我也曾經參觀過兩間鬼經常出現的房子，一棟在嘉義民雄附近，是一座很富麗堂皇的花園洋房，長久以來竟然沒有人居住，聽說那兒常常鬧鬼。另外一棟在台北市仁愛路警察局第四分局的附近，至今大門深鎖，沒有人敢住，聽說鬼也經常在那兒出入。
  鬼是否存在於這個世間，我們不必非去否定破壞不可。好比這個世間，除了人類能夠生存之外，還有其他的飛禽走獸生活其間，雖然和我們不同類，但是不也把人間點綴得五彩繽紛嗎？有一些鬼的存在，也能增加人間的熱鬧，有什麼不好呢？況且堂堂的人類，連並不妨礙我們生存的鬼道都不能包容他，不承認他的存在，那麼，人類的度量不是顯得太狹小了嗎？人類晝夜可以自由工作活動，鬼也只不過深夜才出來走動，彼此互不相犯，不也其樂融融嗎？
  二十五史的晉書裡，記載一位名叫阮瞻，字千里的讀書人，他雖然飽讀詩書，但是堅持不相信有鬼的存在。有一天夜裡，一位文質彬彬的客人來拜訪他，客人的口才很好，辯說無礙。兩人相談甚歡，慢慢地就談到有沒有鬼存在這件事情上來，阮千里一臉不信的神情說：“哼！我就是不相信有鬼的存在，兄台怎麼也和一些村夫漁婦一般迷信？”
  客人再三舉例說明，婉轉地告訴阮千里要相信確實有鬼道眾生，但是任憑客人如何巧說，阮千里還是執著不信地說：“總之，我沒有親眼看見是絕對不會相信的。”
  這時客人終於變色說“古來多少聖賢都認為有鬼的存在，你竟然一再不能相信，我告訴你，我就是鬼！”
  客人說完之後，突然轉身一變，變成面目猙獰的鬼，阮千里一看大驚失色，這一驚嚇就嚇出病來，不到一年就死了。大家聽了這段話，不知道相信不相信有鬼？各位可以測驗自己，假如在三更半夜的時候，突然有一位白衣秀士，或者是窈窕淑女來拜訪你，不知道各位是否有膽量和他談天說地？
  一般人有一個錯誤的觀念，以為人死了一定會變成鬼，看到死人就覺得很恐懼，生怕鬼魂會附上身來。尤其做兒女的，父母去世了，總以祭鬼的儀式來悼拜、超度自己的父母，問他為什麼如此？對方會振振有詞地回答說：因為我先人過亡就要做鬼，墮到地獄去受苦，因此要如此地祭拜他。這種想法實在大為不孝，為什麼不認為我們的祖先也許上生天國，甚至往生極樂世界，為什麼把自己敬重的祖先判刑入地獄去當餓鬼，然後才來超薦他們呢？佛教雖然承認鬼的存在，但是佛教認為人死了之後卻不一定變成人見人怕的鬼。人離開了這個世界，他前往的地方，不僅僅是地獄而已，也許到天堂去享樂，也許再降生為人，縱然輪迴為鬼，也必須具備成為鬼的罪惡因果，才會得到鬼道的報應。我們怎麼忍心將自己的祖先當成惡鬼一般可怕的對象呢？何況鬼也不見得都會找人的麻煩，甚至加害人類，鬼實在沒有我們所想像的那麼恐怖與邪惡。下面我們就來探討鬼的真正形象。
    </article>
  </section>
)

const intro_cn = (
  <section>
    <article>
      <div style={{overflowX: 'hidden'}} >
          大家一定很奇怪，二十世纪科技昌明的时代，我为什么要和大家谈鬼说怪，圣人如孔子也不谈怪力乱神，何况在这么黑暗的夜晚来说鬼，不是耸人听闻，非常不当吗?
          <br/>
          一谈到鬼，我们脑海中马上浮起鬼披头散发、青面獠牙的可怕样子，其实鬼并不可怕。鬼不但不可怕，有一些鬼还很可爱。
          <br/>
          好比动物里面有一些像狮子、老虎、犀牛等可怕的猛兽，但是也有像兔子、麋鹿、猫、狗之类讨人喜欢的可爱动物。同样的，鬼有可怕的恶鬼、厉鬼，但是也有可爱的好鬼、善鬼。
          <br/>
          各位并且可以发现鬼不只在荒郊墓冢里，鬼也在我们的身边附近。例如我们常常听到很多的太太谈到他的先生时，总是娇嗔地说：“我们家那个死鬼呀!
          <br/>
          ……”提到自己乖巧的儿子、女儿时，也会很得意地说：“我那个小鬼呀!……”可见鬼并不可怕，有时候还很可爱，鬼与我们非常靠近。
          <br/>
      　　中国人的民族性宗教信仰的性格很淡，中国人不但不相信鬼的存在，并且喜欢破坏鬼。佛教虽然不主张崇拜鬼，但是却承认鬼的存在，佛教认为鬼是六道众生之一。
          <br/>
          有许多人不承认鬼的存在，并且刻意去破坏鬼的形象，常常自豪地说：“哼!我才不相信有什么鬼呢!”
          <br/>
      我们否定鬼的存在，难道就能消灭鬼道确实存在的真象了吗?在世界上任何一个科学昌明的国家，都承认鬼的存在，像美国的白宫，林肯的鬼魂经常在那儿出没，这在美国已经是妇孺皆晓的事了。
          <br/>
          美国商业部观光局曾经编印一本观光手册，书内报导自从一八○○年以来，全美国各地有名的鬼屋，以及和鬼的传说有关的屋子，一共有二十九间之多，这件事，国内的联合报还曾经刊载过。
          <br/>
      　　在台湾我也曾经参观过两间鬼经常出现的房子，一栋在嘉义民雄附近，是一座很富丽堂皇的花园洋房，长久以来竟然没有人居住，听说那儿常常闹鬼。另外一栋在台北市仁爱路警察局第四分局的附近，至今大门深锁，没有人敢住，听说鬼也经常在那儿出入。
          <br/>
      　　鬼是否存在于这个世间，我们不必非去否定破坏不可。好比这个世间，除了人类能够生存之外，还有其他的飞禽走兽生活其间，虽然和我们不同类，但是不也把人间点缀得五彩缤纷吗?有一些鬼的存在，也能增加人间的热闹，有什么不好呢?况且堂堂的人类，连并不妨碍我们生存的鬼道都不能包容他，不承认他的存在，那么，人类的度量不是显得太狭小了吗?人类昼夜可以自由工作活动，鬼也只不过深夜才出来走动，彼此互不相犯，不也其乐融融吗?
          <br/>
      　　二十五史的晋书里，记载一位名叫阮瞻，字千里的读书人，他虽然饱读诗书，但是坚持不相信有鬼的存在。有一天夜里，一位文质彬彬的客人来拜访他，客人的口才很好，辩说无碍。两人相谈甚欢，慢慢地就谈到有没有鬼存在这件事情上来，阮千里一脸不信的神情说：“哼!我就是不相信有鬼的存在，兄台怎么也和一些村夫渔妇一般迷信?”
          <br/>
      　　客人再三举例说明，婉转地告诉阮千里要相信确实有鬼道众生，但是任凭客人如何巧说，阮千里还是执着不信地说：“总之，我没有亲眼看见是绝对不会相信的。”
          <br/>
      　　这时客人终于变色说“古来多少圣贤都认为有鬼的存在，你竟然一再不能相信，我告诉你，我就是鬼!”
          <br/>
      　　客人说完之后，突然转身一变，变成面目狰狞的鬼，阮千里一看大惊失色，这一惊吓就吓出病来，不到一年就死了。大家听了这段话，不知道相信不相信有鬼?各位可以测验自己，假如在三更半夜的时候，突然有一位白衣秀士，或者是窈窕淑女来拜访你，不知道各位是否有胆量和他谈天说地?
          <br/>
      　　一般人有一个错误的观念，以为人死了一定会变成鬼，看到死人就觉得很恐惧，生怕鬼魂会附上身来。尤其做儿女的，父母去世了，总以祭鬼的仪式来悼拜、超度自己的父母，问他为什么如此?对方会振振有词地回答说：因为我先人过亡就要做鬼，堕到地狱去受苦，因此要如此地祭拜他。这种想法实在大为不孝，为什么不认为我们的祖先也许上生天国，甚至往生极乐世界，为什么把自己敬重的祖先判刑入地狱去当饿鬼，然后才来超荐他们呢?佛教虽然承认鬼的存在，但是佛教认为人死了之后却不一定变成人见人怕的鬼。人离开了这个世界，他前往的地方，不仅仅是地狱而已，也许到天堂去享乐，也许再降生为人，纵然轮回为鬼，也必须具备成为鬼的罪恶因果，才会得到鬼道的报应。我们怎么忍心将自己的祖先当成恶鬼一般可怕的对象呢?何况鬼也不见得都会找人的麻烦，甚至加害人类，鬼实在没有我们所想像的那么恐怖与邪恶。下面我们就来探讨鬼的真正形象。
      </div>
    </article>
  </section>
)

const intro_en = (
  <section>
    <article>

 {["Some people may think it is strange that in this scientifically enlightened century anyone would want to talk about ghosts. In the past, seven sages avoided the subject of the supernatural if they could. Confucius never spoke about ghosts. At the mere mention of ghosts, frightful images instantly arise in our minds of their pale faces, their wild hair and their sharp fangs. The truth is, however, ghosts generally are not very frightening. In fact, many of them are quite cute. Ghosts are like different types of animals: some of them are frightening as lions and tigers, while others are as cute as bunny rabbits and as gentle as little kittens.",

 "Buddhism does not teach people to worship ghosts, but Buddhism does recognize that ghosts exist. The realm of ghosts is one of the six realms of existence among sentient beings. (The six realms are: hell, ghost, animal, human, heaven, asura.)",

 "Many people do not believe in ghosts. Some people even purposely deny the existence of ghosts. They often say smugly, \"Humbug! I do not believe in ghosts.\" However, just because some people deny their existence, does that mean that ghosts really do not exist? People all over the world believe in ghosts. There are stories about ghosts even in the most scientifically advanced counties. The ghosts of Abraham Lincoln is said to appear sometimes in the White House. A tourist pamphlet has been published which describes the twenty-nine well-known haunted houses in the United States.",


 "In Taiwan, I personally have visited two houses where ghosts are known to appear. One is a house in Chiayi. It is a beautiful modern home with a large garden, but no one dares to live there because of the ghosts. In Taipei, I visited another ghost house on Jenai Road, right near a police station. The door of the house is bolted shut and no one has lived there for years. People say ghosts often appear in the house.",

 "We do not have to deny the existence of ghosts regardless of whether they actually exist of not. We already know there are many different kinds of creatures living along side us. Birds, fish, insects and animals of all sorts add to the beauty and variety of life here. If there are also ghosts among us, would the world be that much more interesting? Is it not narrow-minded and arrogant of human beings to deny the existence of life forms different from themselves? People are active during the day and in the early evening. Ghosts are active only late at night. They do not interfere with us and we do not interfere with them. Is that not a convenient arrangement?",

 "In the <i>Twenty-five Historical Tales</i> there is a story about a scholar named Yuan Qianli. Even though Yuan Qianli had read many books and written many poems, he still did not believe in ghosts. Late one night, a very refined and scholarly gentleman visited Yuan Qianli. The visitor was a stranger, but he spoke very well and the two men soon fell to talking about all sorts of things. Eventually, their conversation turned to the subject of ghosts. Yuan Qianli was forceful in his denial of the existence of ghosts. He said, \"Humbug! I do not believe in ghosts. How can someone like you be as superstitious as fishmongers and country folks?\"",

 "Tactfully, his guest gave repeated examples to persuade Yuan that ghosts did exist, but Yuan continued to deny even the possibility of their existence. \"Until I actually see one with my own eyes, I will never believe in ghosts,\" he said.",

 "At this, his guest's demeanor changed dramatically. \"Sages and scholars throughout the ages have believed in ghosts, but you maintain they do not exist. Well, watch this... because <i>I am a ghost</i>.\"",

 "Suddenly the guest's face began to change into a hideous ghost face with wild hair and blazing eyes. Yuan was so frightened that he lost all color in his face and became ill. Within a year he was dead.",

 "If a lone scholar in a white robe visits you in the middle of the night, will you dare to talk to him? What is a shy young woman with a pale face comes to you door at midnight, will you let her in?",

 "Many people have the mistaken belief that after death, everyone turns into a ghost. Dead bodies frighten many people because they believe the ghosts of the body will attach itself to them if they draw too near. When parents pass away, many Chinese have memorial services for the ghosts of the deceased. They think their deceased parents and grandparents are ghosts wandering in hell, and if they do not appease them with ceremonies and gifts, they are not fulfilling their duties as filial sons and daughters. However, is this really a respectful attitude when you think about it? Why do people not believe they ancestors may be reborn in heaven or the Pure Land instead?",

 "Though Buddhism recognizes the existence of ghosts, Buddhism does not teach us that everyone turns into a ghost at death, nor does everyone go to hell. After death, some people may go to heaven and still others are quickly reborn as human beings. A person has to generate a lot of bad karma in this life to become a ghosts after death. Therefore, how can we assume that all deceased ancestors become ghosts? Furthermore, the real ghosts do not always have the power to harm us, and they are not nearly as scary as evil as is commonly believed.",].map((str,i)=>{
    return <div key={i}>{parseItalic(str)}</div>
 })
}
    </article>
  </section>
)
const p1 = (
        <section>
          <article>
					　　世間有好人、壞人的分別，鬼和人一樣，也有好鬼壞鬼的不同。人世間雖然有壞人，但是好人畢竟比壞人多；鬼道中雖然有惡鬼，但是善鬼終究比惡鬼多。有時候人和鬼比起來，人比鬼還要邪惡。我們責怪一個人心術不正時說：「這人的鬼主意真多！」其實人要是真的使起「鬼主意」來，連鬼都要甘拜下風，自歎弗如了。<br/>
					　　<br/>
					　　南陽有個人叫宋定伯，一天夜晚趕路時，在荒野中不巧遇見了鬼，他壯起膽問道：<br/>
					　　<br/>
					　　「喂！你是誰呀？怎麼走路一蹦一跳的？」<br/>
					　　<br/>
					　　「我是鬼啊！咦！你又是誰呀？」<br/>
					　　<br/>
					　　宋定伯一聽，糟糕！今晚活見鬼了，如果坦白告訴對方自己是人，會不會遭遇不測？一個轉念，騙他說：<br/>
					　　<br/>
					　　「我也是鬼呀！」<br/>
					　　<br/>
					　　「你也是鬼呀！那你要到那裡去呢？」<br/>
					　　<br/>
					　　「我要到京城去。」<br/>
					　　<br/>
					　　鬼一聽非常高興地說：<br/>
					　　<br/>
					　　「好極了！我也剛巧要到京城去，咱們正好結伴同行。」<br/>
					　　<br/>
					　　宋定伯無奈，只好硬著頭皮和鬼一前一後地走著，走了一段路後，覺得有點疲倦了，鬼就提議說：<br/>
					　　<br/>
					　　「路途遙遠，這樣子走法實在太辛苦了，不如我們輪流相揹著走，既可趕路，又可休息，你看好不好？」<br/>
					　　<br/>
					　　「好呀！」<br/>
					　　<br/>
					　　「那我先揹你。」鬼說完，就把宋定伯往身上一揹。<br/>
					　　<br/>
					　　「哎呀！你怎麼這樣重啊！」<br/>
					　　<br/>
					　　鬼沒有一定的形象，也沒有重量，鬼只是一種氣，他可以穿牆而過，也可以隱形不見，因此鬼會覺得人怎麼如此的重。宋定伯聽鬼一問，趕忙撒個謊說：<br/>
					　　<br/>
					　　「我是剛死的鬼，所以比較重嘛！」<br/>
					　　<br/>
					　　鬼信以為真，繼續走著，走到一條江水濤濤的河邊，鬼指著河說：<br/>
					　　<br/>
					　　「現在我們只好游泳過去啦！」<br/>
					　　<br/>
					　　說完縱身一騰，輕飄飄無聲無息地游到了對岸，轉身看到宋定伯在水中費力的划動雙臂，發出「澎通！澎通！」的巨響，慢慢地游過來。鬼氣急敗壞地說：<br/>
					　　<br/>
					　　「喂！你的聲音為什麼這麼大呀！給人聽到會嚇壞他們的。」<br/>
					　　<br/>
					　　宋定伯看到鬼在起疑心，趕快辯稱：<br/>
					　　<br/>
					　　「我剛死，還沒學會游泳啊！」<br/>
					　　<br/>
					　　上岸之後，兩個又起程趕路，宋定伯心想：今天真霉運，碰見了鬼，總要想個法子擺脫他才好，於是裝出一臉謙虛求教的樣子說：<br/>
					　　<br/>
					　　「老兄，我剛剛才死不久，對於我們鬼的情形不大明瞭，你是經驗多，請你告訴我，我們鬼最害怕什麼？」<br/>
					　　<br/>
					　　「我們鬼最害怕人類的唾沫，萬一有人對我們吐痰，我們就一點辦法也沒了。」鬼很誠實地回答他。<br/>
					　　<br/>
					　　這時天際漸漸現出曙光，眼看京城快到了。宋定伯趁著鬼沒有注意的時候，趁其不備，突然往鬼的身上吐了一口痰，只見鬼痛苦地扭著身子在地上翻滾打轉，轉著轉著，鬼不見了，變成了一頭馴服的小山羊。宋定伯就把這頭羊牽入城裡，賣了一千錢。<br/>
					　　<br/>
					　　這段故事說明人的狡猾、奸詐、狠毒、無情，有時連鬼都難以望其項背，鬼以誠懇、信任、坦率、真實的心來幫助人，而人所回報的卻是欺騙、無義、諂曲、自私的態度。有時人是個滿懷鬼胎，比鬼還恐怖的人間惡鬼。<br/>
					　　<br/>
					　　有些鬼雖然凶惡，會傷害我們的性命，但是對於正氣凜然的正人君子，或是修持有道的沙門僧侶，無論如何凶厲的惡鬼，也使不出可怕的伎倆。俗話說：平生不做虧心事，半夜不怕鬼敲門。外面的鬼不恐怖，內心的鬼才可怕。<br/>
					　　<br/>
					　　有一位老和尚正在盤腿打坐時，有個鬼披頭散髮地跑來擾亂他，老和尚說：<br/>
					　　<br/>
					　　「哎喲！這個是什麼東西啊？怎麼披頭散髮威儀不整，不好意思見人那！」<br/>
					　　<br/>
					　　鬼一看，不但沒有嚇著老和尚，反而被指正了一頓，趕快伸出長長的舌頭，現出青面獠牙的樣子，老和尚看了說：<br/>
					　　<br/>
					　　「這有什麼了不起！只不過臉孔青了點，牙齒、舌頭比我長一些而已。」<br/>
					　　<br/>
					　　鬼一聽，還是沒嚇走老和尚，再變，眼睛沒有了、鼻子沒有了，甚至手腳也沒有，老和尚依舊若無其事的長歎一聲說：<br/>
					　　<br/>
					　　「實在可憐！怎麼眼睛、鼻子、手、腳都不見了呢？」<br/>
					　　<br/>
					　　鬼終於黔驢技窮，落荒而逃。老和尚看到鬼的可怕樣子，心中生起的是對鬼的慈悲，悲憫他為何得此果報。仁者無敵，在慈悲之前，一切的邪惡力量將遁匿無形。我們都以為人怕鬼，事實上，鬼一看到人總是要離得遠遠的，避到一旁。好比天上的飛鳥，地下的水族走獸，看到人類也會逃得遠遠的。鬼在白天不敢出來作怪，等到黑夜才出現，這就是鬼怕人的有力證明。所以縱然遇到了鬼，也不必驚慌，鬼只是和我們業報不同的另一道眾生罷了。<br/>
					　　<br/>
					　　《幽冥錄》裡記載一位名叫阮德如的人，一天夜半起床如廁，在廁所裡看到一個身高丈許長，眼睛大如銅鈴，面容黝黑，身穿白色衣單的鬼，靜靜地站在呎尺之外和阮德如對看，阮德如看了，神閑氣定地笑著說：<br/>
					　　<br/>
					　　「人們說鬼的形象奇醜無比，面目可憎，今日一看，果然不錯！」<br/>
					　　<br/>
					　　茅廁鬼聽到阮德如這麼一說，羞愧得面紅耳赤，隱然退去。可見鬼有時比人類還有慚愧羞恥心。人只要光明磊落，有善惡因果觀念，鬼是不敢侵犯我們的。<br/>
					　　<br/>
					　　在什麼情形下才會墮落成鬼？鬼道眾生的因緣果報究竟如何？《業報差別經》提到眾生由於下面十業，而墮入鬼道：<br/>
					　　<br/>
					　　1.身作惡：身體做出殺生、偷盜、邪淫等惡業。<br/>
					　　<br/>
					　　2.口作惡：口中造作妄語、惡口、兩舌、綺語等惡業。<br/>
					　　<br/>
					　　3.意作惡：心裡充滿貪欲、瞋恚、愚痴等惡業。<br/>
					　　<br/>
					　　4.慳貪：貪取妄執，不知結緣施捨。<br/>
					　　<br/>
					　　5.妄求非分：不是自己份內的東西，而起覬覦非份之想。<br/>
					　　<br/>
					　　6.諂曲嫉妒：諂媚邪曲，嫉妒別人比自己好，而起惡心。<br/>
					　　<br/>
					　　7.起於邪見：無道德、善惡、因果報應，邪知邪見。<br/>
					　　<br/>
					　　8.愛著不捨：愛戀執著心重，不能喜捨放下。<br/>
					　　<br/>
					　　9.因饑而死：飢餓而死，成為餓鬼。<br/>
					　　<br/>
					　　10.枯竭而死：如草木一般乾枯而死。<br/>
					　　<br/>
					　　佛弟子神通第一的目犍連尊者，經常來往地獄探望鬼道眾生。在《佛說鬼問目連經》中，記載鬼道眾生與目犍連尊者的問答，從這些問答中，可以了解鬼道眾生因果受報的種種情形。<br/>
					　　<br/>
					　　一鬼痛苦地問目犍連尊者：<br/>
					　　<br/>
					　　「尊者，我已墮落地獄，受種種痛苦的刑罰，為什麼我的頭還是經常疼痛欲裂呢？」<br/>
					　　<br/>
					　　尊者回答：「因為你過去做人時，常拿東西敲打別人的頭，所以，雖然做了鬼，還要受頭痛的果報。」<br/>
					　　<br/>
					　　另外一個鬼接著問：<br/>
					　　<br/>
					　　「尊者，我做鬼好可憐喲！沒有房子可以遮風蔽雨，經常露宿在街頭，為什麼我會生活得如此悲慘呢？」<br/>
					　　<br/>
					　　目犍連尊者回答：「因為你過去出生在大富人家，別人要借宿你的房子，你卻百般刁難，給人種種不便，因此現在做了鬼，只好餐風露宿了。」<br/>
					　　<br/>
					　　「尊者，我雖然做了鬼，但是我有很多的錢財。不知怎麼的，我還是習慣穿破舊的衣服，這是什麼原因呢？」又有一鬼提出問題。<br/>
					　　<br/>
					　　「過去你在人間知道做善事，但是在布施之後，卻又生起懊悔心。布施的功德，使你得到富貴的果報，但是懊悔的念頭，使你捨不得吃穿，只能穿著破舊的衣服，過著清苦的日子。」<br/>
					　　<br/>
					　　大家爭先恐後的向尊者討教，旁邊有一個瘦骨嶙峋的鬼，發出細細的聲音問道：<br/>
					　　<br/>
					　　「尊者，為什麼我做了鬼經常吃不到東西，餓得兩眼昏花呢？」<br/>
					　　<br/>
					　　「你過去負責寺院庫房的工作，人家給你二十塊錢，你卻苛扣錢財，只買了十塊錢的菜，所以才有這樣的業報。」<br/>
					　　<br/>
					　　「尊者，我做了鬼為什麼還渾身疼痛，如針刺刀扎、烈火焚燒般痛楚呢？」<br/>
					　　<br/>
					　　「那是你過去世喜歡捕漁狩獵，殺害生靈的緣故。」目犍連尊者無限慈悲地回答。<br/>
					　　<br/>
					　　有一鬼等大家七嘴八舌都問完了，才慢吞吞問道：<br/>
					　　<br/>
					　　「尊者，為什麼我做了鬼，卻不如其他的鬼那樣靈巧黠慧呢？」<br/>
					　　<br/>
					　　「那是因為你過去貪愛杯中物，並且經常假應酬之名，向人強行勸酒、勸肉，因此現在智慧缺乏，比較愚痴。」目犍連不厭其煩的為群鬼解答，去除了他們心中的疑團。<br/>
					　　<br/>
					　　從目犍連尊者和群鬼間的問答中，我們能夠明確的認識，了解鬼的因緣果報。<br/>
					　　<br/>
          </article>
        </section>
)

const p2 = (
			<section>
				<article>
				　　鬼有那些種類？他們的身形又是如何？《阿毘達磨順正理論》將鬼分為三類：<br/>
				　　<br/>
				　　1.多財鬼：好比人間有大富大貴的人家一樣，多財鬼享有豐富的祭祀，衣食不缺，如居住在社祠之中，受人祭拜的有主鬼，或者大勢大福的天神，都屬於這種多財鬼。<br/>
				　　<br/>
				　　2.少財鬼：好比人間的一般平民，雖有祭祀，但是享樂比多財鬼稍為遜差。<br/>
				　　<br/>
				　　3.無財鬼：好比人間居無定所，三餐不繼，靠著別人賑濟為生的人。無財鬼是流蕩荒野的無主鬼，人們有時啟薦無遮超度法會時，無財鬼就來應供，吃點美食。<br/>
				　　<br/>
				　　《大毘婆沙論》則將鬼分成兩種：<br/>
				　　<br/>
				　　1.有威德鬼：身形高大，頭戴華鬘帽冠，身著錦麗天衣，平日吃的是珍餚美食，出門乘坐象馬拖拉的車輿，侍衛僕從圍繞左右，並且有種種的娛樂生活，宛如人間的帝王天子。譬如，城隍老爺就是屬於有威德鬼。<br/>
				　　<br/>
				　　2.無威德鬼：頭髮蓬亂如草，覆蓋額面，衣不蔽身，甚至裸體而行。容貌醜陋，顏色枯悴難看，走路時，手中拿著破瓦缽，好像人間的乞丐。有時我們看到衣衫襤褸、身體臭穢的窮苦人家，往往會脫口說：「這人真像鬼！」這就是無威德鬼的人間例證。<br/>
				　　<br/>
				　　鬼又可分為大鬼、小鬼。大鬼身長一由旬，由旬為印度人計算度量衡的單位，一由旬大約等於二十華里，大鬼究竟有多麼高大就可想而知了。大鬼的頭像高山那麼巨大，我們俗稱為大頭鬼。大鬼喉嚨細小如針，經常吃不到食物，因此身體羸弱，頭髮雜亂不潔。由於身體長得很高大，因此都拄著拐杖行走。小鬼身體大約只有三吋長，像嬰兒那麼幼小。<br/>
				　　<br/>
				　　鬼有美麗的鬼，也有醜陋的鬼。美鬼就像天人般的莊嚴好看，一點也不恐怖；醜鬼的特點是好流鼻涕，身上長滿瘀膿，常常出血。鬼有富貴的鬼，也有貧賤的鬼。貴鬼如大力鬼王，受人尊敬祭拜；賤鬼如無祀孤魂，飄泊不定。<br/>
				　　<br/>
				　　不管貴鬼、賤鬼；美鬼、醜鬼；大鬼、小鬼，乃至有威德鬼、無威德鬼，或是多財鬼、少財鬼、無財鬼，不都是人間千差萬別的鮮明寫照嗎？因此鬼不一定存在於地獄，人間也能看到鬼道的縮影。<br/>
				　　<br/>
				　　如滿禪師的王姓朋友逝世了，他去為朋友誦經超度。一年之後，在他前往揚州的途中，卻遇到這位朋友，如滿禪師驚詫萬分地問道：<br/>
				　　<br/>
				　　「咦？你不是早已死了嗎？怎麼還在這裡行走呢？」<br/>
				　　<br/>
				　　王姓朋友趕快阻止禪師說：<br/>
				　　<br/>
				　　「噓！不要喧嚷，我們到山谷再細談吧！」<br/>
				　　<br/>
				　　到深山幽谷裡，王姓朋友才說道：<br/>
				　　<br/>
				　　「禪師，坦白告訴你，我現在是鬼不是人，由於我過去在人間沒做過什麼壞事，並且富有正義感，為人有俠氣，再加上你的法力超度，因此閻王老爺派給我巡察鬼的差使。」<br/>
				　　<br/>
				　　「哦！巡察鬼都做些什麼事呢？」<br/>
				　　<br/>
				　　「人間如果有貪官污吏、奸商巨賈，我就把他們的罪行一一詳記下來；不管什麼大斗小秤、殺盜淫掠的勾當，我都要一五一十報告閻君，總有一天，叫他們有債還債，殺人償命，接受果報懲罰。」<br/>
				　　<br/>
				　　王姓朋友說完後，從懷中掏出一朵紅色的鮮花，送給如滿禪師，感謝他昔日超度救拔的恩澤。禪師看了婉拒說：<br/>
				　　<br/>
				　　「我是個和尚，要這朵花做什麼？」<br/>
				　　<br/>
				　　「這朵花不同於一般的花，你拿在手上，可以辨別什麼是人，什麼是鬼？」<br/>
				　　<br/>
				　　「手中拿這朵花，我如何知道誰是人，誰是鬼呢？」<br/>
				　　<br/>
				　　「只要你拿著這朵花在街上走，正人君子，瞧也不瞧花一眼。相反地，鬼就會目不轉睛的盯著這朵花。假如對方看到花就搔首弄姿，這是個虛榮鬼；假如對方不但看花，還注視著人的話，那一定是個好色鬼；如果看到了花，又看看自己，可以判斷這是貪心鬼；如果看了花，然後直搓雙手的，那就是占便宜鬼了。」<br/>
				　　<br/>
				　　禪師和朋友互道珍重後，手中拿著花走在大街上，對面來了一個人，昂首闊步地擦身而過，目不斜視，如如不動不瞧花一眼。<br/>
				　　<br/>
				　　「嗯！這是個正人君子。」<br/>
				　　<br/>
				　　再走幾步，碰到一位穿著入時，打扮得珠光寶氣的女子，直往花兒瞧。<br/>
				　　<br/>
				　　「這是個虛榮鬼。」<br/>
				　　<br/>
				　　走了一段，迎面走來一位衣冠楚楚的翩翩公子，不但看花，還死盯著禪師瞧，失望地說：「唉！是個老和尚。」<br/>
				　　<br/>
				　　「哼！原來是個好色鬼。」禪師不悅地喃喃自語。<br/>
				　　<br/>
				　　繼續走了沒多久，看到一個人一會兒看花，一會兒看自己。<br/>
				　　<br/>
				　　「喔！是個貪心鬼。」如滿禪師拐了個彎，走上了另一條街道，一個人從老遠看到禪師的紅花，就直搓著雙手不放。<br/>
				　　<br/>
				　　「哈！碰到了個占便宜鬼。」<br/>
				　　<br/>
				　　不久禪師回到了寺門口，心想這朵花不適合帶到寺裡去，隨手往身後一丟，一腳正要跨進寺裡時，忽然聽到後面有吵鬧的聲音，回頭一看，原來剛才在路上遇到的鬼魅都跟來了，你搶我奪的，爭著搶那朵被丟棄在地上的紅花。最後，其中一個鬼，搶到那朵花，禪師仔細一看，這那裡是美麗的花朵，只不過是一根死人的臭骨頭。<br/>
				　　<br/>
				　　在花花世界裡，有時我們費盡心機，用盡手段，努力去爭取而來的名利富貴，到頭來所得到的是什麼？所留下的又是什麼呢？還不是黃土一抔、朽骨一堆。古德說：「今日不知明日事，那有工夫計是非。」人生該爭的不是浮華不實的鮮花，而是血汗所凝成的甘果。<br/>
				　　<br/>

				</article>
			</section>
)



const p3 = (
			<section>
				<article>
				　　人類住在娑婆世間，在地球上面，鬼住在什麼地方？人類的生活裡苦樂參半，鬼有什麼苦樂呢？《大毘婆沙論》說：富貴的鬼住山谷裡、海水邊、半空中、樹林裡，或者是人們祭祀的靈廟祠堂，並且都蓋有富麗的宮殿，好比人間有的住在塵囂鬧市的高樓大廈，或是山明水秀的豪華別墅一樣。貧賤的鬼住在荒郊野外的墓塚裡，或是糾葛漫長的草木堆、污穢骯髒的屎糞茅廁、荒廢無人的古宅廢墟裡。<br/>
				　　<br/>
				　　鬼的生活，有過得很艱苦的，也有過得很快樂的。苦鬼常常感到饑腸轆轆、乾渴難忍，經年累月聽不到漿水米粥的聲音，縱然遇到了河水，也無法享用。雙手捧起清水，正要喝時馬上變成熊熊的火焰，即使喝入咽喉，也被焚燒焦爛，再甘美的食物祭拜他，都無法救他的累劫饑渴。如果真有誠心救度，可以備辦簡單的素果菜茗，以佛門的誦經持咒、神力加持去其咽喉火焰，還有實際的功德利益，切忌再為亡魂殺生；三牲齊備，只有增加他的罪業。<br/>
				　　<br/>
				　　《地藏經》說，為鬼魂誦經超度的功德，活著的人可以得到七分之六，而亡者只能得到七分之一。因此人生在世，應該趁著身強體健時，多為自己行善積些功德，否則等到兩腿一伸，才要勞駕別人為我們超度就太遲了。<br/>
				　　<br/>
				　　樂鬼的生活每天豐衣美食，驅駕車乘，飛馳自如，任情遊戲享盡快樂。樂鬼的享樂雖然勝於人間，但是總比不上人間好，並且他們膽量非常小，晝伏夜遊，白天不敢出來行動，有亮光的地方也不敢出現。縱然出來活動，碰到了人，也是膽怯畏懼，閃避在角落陰暗處，怕被人撞著。鬼如此的懼怕我們，人類大可不必談鬼色變。<br/>
				　　<br/>
				　　談到鬼的生活，我們人類由於無知執迷，有時往往干涉到鬼的生活自由。在台灣的民情風俗裡，有娶死人的牌位回來做妻子的陋習。有一對父母硬要把已經死去幾年的女兒嫁給一位青年。這個女兒活著的時候，為了爭取愛情自由不果而死亡。現在父母還要強迫她，亡魂很不高興：<br/>
				　　<br/>
				　　「爸媽，我在世時，你們不給我感情的自由。現在我死了做鬼，還強迫我嫁人。」<br/>
				　　<br/>
				　　這女孩也覺得這位青年沒有出息，不去迎娶活人，偏要討個鬼做老婆，於是故意捉弄他。洞房花燭夜的晚上，這兒打他一記耳光，那兒打他一下臉頰，整個晚上新郎官沒有見著新娘子，耳光倒是挨了不少。青年被打得鼻青臉腫，第二天清晨趕快叫人把牌位退回去。<br/>
				　　<br/>
				　　為什麼要做這種愚痴的事呢？把牌位討回家，和女鬼同榻而眠，不是人間奇聞嗎？台灣民間還流行燒汽車、洋房、美鈔、電視、電冰箱等現代用品給亡者的風氣。其實，鬼具有五神通，他想到那裡去，運用神足通，馬上就能到達目的地。如果鬼真的乘坐汽車，還要發動引擎，反而嫌慢。何況如果人人都燒汽車，地獄的交通不是要大為混亂，車禍頻傳了嗎？我們所用的電視、電冰箱等家用電器，電壓的度數有220V或110V，不知道地獄適用不適用？美鈔雖然是世界通用的貨幣，但是美鈔拿到世界某些國家還是無法兌現的，在陰間美鈔也是行不通的。<br/>
				　　<br/>
				　　鬼有他們自己的生活方式，我們不必為他們操心，親人過世了，也不要以為他一定會變成鬼。我們紀念祖先，不必花一把鈔票買一堆金銀紙，把可貴的金錢付之火炬，變成沒有意義的灰燼。我們可以用祖先的名義設立獎學金，作育天下英才，或者捐獻給社會公益事業，興學辦校，印行善書，讓祖先能夠遺愛人間，留芳萬世。<br/>
				　　<br/>
				　　關於鬼生活的苦樂情形，中國古書裡有一段精彩絕倫的記載。有位剛死不久的鬼，老是找不到食物，他乾癟著肚子到處飄蕩，碰到了一個老鬼，老鬼就說：<br/>
				　　<br/>
				　　「喂！你怎麼面黃肌瘦，一臉憔悴呢？」<br/>
				　　<br/>
				　　「我做鬼已經好幾天，一直都沒有東西吃，怎麼不消瘦呢？老兄，你做鬼比較有經驗，能不能告訴我如何才能改善生活。」<br/>
				　　<br/>
				　　「那還不簡單，像我們這一類，只要裝神弄鬼一番，就有辦法啦！」老鬼倚老賣老地傳授錦囊妙計。<br/>
				　　<br/>
				　　新鬼恍然大悟，於是跑到城東一戶窮人家裡。那戶人家正在磨麵粉，他一進去就替他們推磨子，磨起麵粉來。這一家人看了大叫：<br/>
				　　<br/>
				　　「這磨子沒人推，怎麼自己動起來了呢？也許是佛菩薩慈悲，可憐我們家裡貧窮，派個鬼來替我們推磨吧。」<br/>
				　　<br/>
				　　這新鬼從初更一直推到天亮，推得精疲力盡，兩眼昏花，卻一點東西也沒有吃到，就怒氣沖沖地跑去找老鬼：<br/>
				　　<br/>
				　　「喂！老兄，你叫我裝神弄鬼就能改善生活，可是昨晚我去替城東的人家推了一夜的磨，卻什麼東西也沒吃到。」<br/>
				　　<br/>
				　　「哎喲！你真糊塗，你去的那戶人家是信奉佛祖的，他們有正信，不怕鬼，怎麼會給你東西吃呢？」<br/>
				　　<br/>
				　　「好！那我今晚到城西換一家。」<br/>
				　　<br/>
				　　新鬼趁夜色迷濛趕到了城西，找了一家舂米的，趁著人們休息時，拿起棒子，兀自舂搗了起來。這家人看了都嘖嘖稱奇：<br/>
				　　<br/>
				　　「唷！昨夜佛祖慈悲叫鬼到城東去推磨；今天祖師爺顯威，也叫鬼到咱們家來舂米。」<br/>
				　　<br/>
				　　新鬼賣力地舂到天明雞啼，腰酸背痛，渾身無力，還是沒有吃到任何東西，便氣憤不已地回去找老鬼算帳：<br/>
				　　<br/>
				　　「你倒說說看，這一家人為什麼也不給我東西吃呢？」<br/>
				　　<br/>
				　　「老弟，這一家是信仰道教的，他們不但不怕鬼，還要抓鬼呢。」<br/>
				　　<br/>
				　　「那我怎麼辦呢？」<br/>
				　　<br/>
				　　「你去找一戶沒有供奉佛像或是神明的人家，就萬事可行了。」<br/>
				　　<br/>
				　　新鬼努力的尋找，終於找到一戶什麼也沒有供奉的人家。一腳跨進去，一屋子人圍著香噴噴的魚肉酒菜大吃大嚼。新鬼看得垂涎欲滴，不知如何裝神弄鬼，突然看到桌腳下蹲著一隻瘦瘦的狗，搖尾乞憐地等待主人丟下的骨頭。新鬼一把抓起狗，在空中迅速的飛行。<br/>
				　　<br/>
				　　「不得了啦！這隻狗怎麼會在空中飛行？中了什麼邪嗎？」<br/>
				　　<br/>
				　　一家人亂了手腳，有人提出意見找耶穌來幫忙，有人馬上否定說：<br/>
				　　<br/>
				　　「耶穌有辦法感化人，這是鬼，他沒有辦法的。」<br/>
				　　<br/>
				　　又有人建議：<br/>
				　　<br/>
				　　「我們讀聖賢書，應該尊重孔老夫子，我們請夫子來幫忙吧！」<br/>
				　　<br/>
				　　「你難道忘了，孔夫子叫我們敬鬼神而遠之，何況夫子本人還不語怪力亂神，求他是沒有用的。」有人振振有詞地反對。<br/>
				　　<br/>
				　　大家你一言、我一語，不知如何是好？最後終於決定找神壇的乩童來做法：<br/>
				　　<br/>
				　　「這是鬼魂在作祟，你們趕快把這條狗殺了，並且備辦豐盛的三牲酒菜來祭拜，這鬼就服服貼貼了。」<br/>
				　　<br/>
				　　這家人趕忙依言辦了一桌酒席來祭鬼，鬼飽餐一頓，從此食髓知味，再也不肯離開，天天上門作怪討吃，這就叫做「引鬼上門」。<br/>
				　　<br/>
				　　我們為人處世要堂堂正正、光明磊落，千萬不要引鬼上門。譬如有的人結交地痞流氓、黑道殺手，只要找他們幫一次忙，和他們搭上了線，將來就會麻煩無盡，甚至把生命都賠上。台灣民間，各地都有拜好兄弟的陋習，把這些邪魔外道引進自己的家門，還將他奉為上賓，將來勢必會惹禍上身。我們要尊敬有道有德的人，尊敬正派、有學問的人，和這些魑魅魍魎涇渭分明，互不來往，如此必能永保康泰平安。<br/>
				　　<br/>

				</article>
			</section>
)


const p4 = (
			<section><article>
				　　宇宙間，十法界各有他們的世界，佛有佛的世界，譬如東方琉璃世界，西方極樂世界；天神有天神的世界，譬如三界二十八天；人有人的世界，譬如三大洋五大洲，人類有種族、身體、富貧、智愚等種種差別；畜生有畜生的世界，譬如天上飛的鳥、地上走的獸、海裡游的魚等，種類繁多。同樣的，地獄餓鬼也有他們的世界。鬼的世界和人一樣，有他們自己的眷屬，並且還須要工作謀生，鬼的社會也有貧富貴賤的差別，彼此之間少不了是非恩怨。鬼的性格千差萬別，有脾氣暴躁的，有性情凶殘的，當然也不失溫馴善良的。<br/>
				　　<br/>
				　　其實，鬼的存在和我們的人生有很密切的關係，因為在我們的人間到處充滿著鬼。什麼是人間的鬼呢？有不良習慣的都名之為鬼。譬如喜歡吞雲吐霧，煙嘴不離口的叫煙鬼；貪愛杯中之物，每天喝得醉眼醺醺的叫酒鬼；沈迷方城之戰，賭得天昏地暗的叫賭鬼；戀眷朱顏女色，耽溺不知自拔的叫色鬼。我們常將一些壞的名詞加在鬼的身上，舉凡有惡劣的性情、不良行為的，我們就稱之為鬼，例如懶惰鬼、膽小鬼、疑心鬼、嫉妒鬼、小氣鬼、貪心鬼、吝嗇鬼、淘氣鬼、缺德鬼，甚至剝削民脂民膏的吸血鬼等等，誰說人間沒有鬼呢？<br/>
				　　<br/>
				　　我們只知道請法師道士來超薦陰間的鬼，卻不知道人間的鬼更需要度化。陰間的鬼超薦了，就可以夜行不驚，宅第平安；人間的鬼度化了，就可以民風轉善，社會祥和。如何來度化這些人間的鬼怪呢？佛教的三皈、五戒、六度、十善，就是超度人間鬼怪的法門。<br/>
				　　<br/>
				　　譬如三皈依，皈依佛寶永不墮地獄，皈依法寶永不墮畜生，皈依僧寶永不墮餓鬼。受持了五戒，不殺生、不偷盜、不邪淫、不妄語、不飲酒，從此遠離罪惡淵藪，不再種植墮落地獄的種子，當然就不會淪為惡鬼了。目前的社會人心澆薄，道德淪喪，如果我們不幸染上惡鬼的習性，趕快痛下決心來接受佛法的治療，多多提倡善良的風氣，提高民眾的知識教育，提昇社會的道德水準，把這些在鬼門關裡遊蕩的鬼，早日解救出來。<br/>
				　　<br/>
				　　我們應該共同淨化這個社會，使社會沒有鬼的存在，每一個都是頂天立地的人，都是悲智雙運的佛。每一人都能轉鬼性為佛性，化凡心為佛心，如此，我們的人間就是人間淨土，而不是人間煉獄。
				</article>
			</section>
)

const p1_cn = (
  <section>
    <article>
  　　世间有好人、坏人的分别，鬼和人一样，也有好鬼坏鬼的不同。人世间虽然有坏人，但是好人毕竟比坏人多；鬼道中虽然有恶鬼，但是善鬼终究比恶鬼多。有时候人和鬼比起来，人比鬼还要邪恶。我们责怪一个人心术不正时说：「这人的鬼主意真多！」其实人要是真的使起「鬼主意」来，连鬼都要甘拜下风，自叹弗如了。 <br/>
  　　<br/>
  　　南阳有个人叫宋定伯，一天夜晚赶路时，在荒野中不巧遇见了鬼，他壮起胆问道：<br/>
  　　<br/>
  　　「喂！你是谁呀？怎么走路一蹦一跳的？」<br/>
  　　<br/>
  　　「我是鬼啊！咦！你又是谁呀？」<br/>
  　　<br/>
  　　宋定伯一听，糟糕！今晚活见鬼了，如果坦白告诉对方自己是人，会不会遭遇不测？一个转念，骗他说：<br/>
  　　<br/>
  　　「我也是鬼呀！」<br/>
  　　<br/>
  　　「你也是鬼呀！那你要到那里去呢？」<br/>
  　　<br/>
  　　「我要到京城去。」<br/>
  　　<br/>
  　　鬼一听非常高兴地说：<br/>
  　　<br/>
  　　「好极了！我也刚巧要到京城去，咱们正好结伴同行。」<br/>
  　　<br/>
  　　宋定伯无奈，只好硬着头皮和鬼一前一后地走着，走了一段路后，觉得有点疲倦了，鬼就提议说：<br/>
  　　<br/>
  　　「路途遥远，这样子走法实在太辛苦了，不如我们轮流相背着走，既可赶路，又可休息，你看好不好？」<br/>
  　　<br/>
  　　「好呀！」<br/>
  　　<br/>
  　　「那我先背你。」鬼说完，就把宋定伯往身上一背。 <br/>
  　　<br/>
  　　「哎呀！你怎么这样重啊！」<br/>
  　　<br/>
  　　鬼没有一定的形象，也没有重量，鬼只是一种气，他可以穿墙而过，也可以隐形不见，因此鬼会觉得人怎么如此的重。宋定伯听鬼一问，赶忙撒个谎说：<br/>
  　　<br/>
  　　「我是刚死的鬼，所以比较重嘛！」<br/>
  　　<br/>
  　　鬼信以为真，继续走着，走到一条江水涛涛的河边，鬼指着河说：<br/>
  　　<br/>
  　　「现在我们只好游泳过去啦！」<br/>
  　　<br/>
  　　说完纵身一腾，轻飘飘无声无息地游到了对岸，转身看到宋定伯在水中费力的划动双臂，发出「澎通！澎通！」的巨响，慢慢地游过来。鬼气急败坏地说：<br/>
  　　<br/>
  　　「喂！你的声音为什么这么大呀！给人听到会吓坏他们的。」<br/>
  　　<br/>
  　　宋定伯看到鬼在起疑心，赶快辩称：<br/>
  　　<br/>
  　　「我刚死，还没学会游泳啊！」<br/>
  　　<br/>
  　　上岸之后，两个又起程赶路，宋定伯心想：今天真霉运，碰见了鬼，总要想个法子摆脱他才好，于是装出一脸谦虚求教的样子说：<br/>
  　　<br/>
  　　「老兄，我刚刚才死不久，对于我们鬼的情形不大明了，你是经验多，请你告诉我，我们鬼最害怕什么？」<br/>
  　　<br/>
  　　「我们鬼最害怕人类的唾沫，万一有人对我们吐痰，我们就一点办法也没了。」鬼很诚实地回答他。 <br/>
  　　<br/>
  　　这时天际渐渐现出曙光，眼看京城快到了。宋定伯趁着鬼没有注意的时候，趁其不备，突然往鬼的身上吐了一口痰，只见鬼痛苦地扭着身子在地上翻滚打转，转着转着，鬼不见了，变成了一头驯服的小山羊。宋定伯就把这头羊牵入城里，卖了一千钱。 <br/>
  　　<br/>
  这段故事说明人的狡猾、奸诈、狠毒、无情，有时连鬼都难以望其项背，鬼以诚恳、信任、坦率、真实的心来帮助人，而人所回报的却是欺骗、无义、谄曲、自私的态度。有时人是个满怀鬼胎，比鬼还恐怖的人间恶鬼。 <br/>
  　　<br/>
  　　有些鬼虽然凶恶，会伤害我们的性命，但是对于正气凛然的正人君子，或是修持有道的沙门僧侣，无论如何凶厉的恶鬼，也使不出可怕的伎俩。俗话说：平生不做亏心事，半夜不怕鬼敲门。外面的鬼不恐怖，内心的鬼才可怕。 <br/>
  　　<br/>
  　　有一位老和尚正在盘腿打坐时，有个鬼披头散发地跑来扰乱他，老和尚说：<br/>
  　　<br/>
  　　「哎哟！这个是什么东西啊？怎么披头散发威仪不整，不好意思见人那！」<br/>
  　　<br/>
  　　鬼一看，不但没有吓着老和尚，反而被指正了一顿，赶快伸出长长的舌头，现出青面獠牙的样子，老和尚看了说：<br/>
  　　<br/>
  　　「这有什么了不起！只不过脸孔青了点，牙齿、舌头比我长一些而已。」<br/>
  　　<br/>
  　　鬼一听，还是没吓走老和尚，再变，眼睛没有了、鼻子没有了，甚至手脚也没有，老和尚依旧若无其事的长叹一声说：<br/>
  　　<br/>
  　　「实在可怜！怎么眼睛、鼻子、手、脚都不见了呢？」<br/>
  　　<br/>
  　　鬼终于黔驴技穷，落荒而逃。老和尚看到鬼的可怕样子，心中生起的是对鬼的慈悲，悲悯他为何得此果报。仁者无敌，在慈悲之前，一切的邪恶力量将遁匿无形。我们都以为人怕鬼，事实上，鬼一看到人总是要离得远远的，避到一旁。好比天上的飞鸟，地下的水族走兽，看到人类也会逃得远远的。鬼在白天不敢出来作怪，等到黑夜才出现，这就是鬼怕人的有力证明。所以纵然遇到了鬼，也不必惊慌，鬼只是和我们业报不同的另一道众生罢了。 <br/>
  　　<br/>
  《幽冥录》里记载一位名叫阮德如的人，一天夜半起床如厕，在厕所里看到一个身高丈许长，眼睛大如铜铃，面容黝黑，身穿白色衣单的鬼，静静地站在呎尺之外和阮德如对看，阮德如看了，神闲气定地笑着说：<br/>
  　　<br/>
  　　「人们说鬼的形象奇丑无比，面目可憎，今日一看，果然不错！」<br/>
  　　<br/>
  　　茅厕鬼听到阮德如这么一说，羞愧得面红耳赤，隐然退去。可见鬼有时比人类还有惭愧羞耻心。人只要光明磊落，有善恶因果观念，鬼是不敢侵犯我们的。 <br/>
  　　<br/>
  　　在什么情形下才会堕落成鬼？鬼道众生的因缘果报究竟如何？ 《业报差别经》提到众生由于下面十业，而堕入鬼道：<br/>
  　　<br/>
    1.身作恶：身体做出杀生、偷盗、邪淫等恶业。 <br/>
　　<br/>
　　2.口作恶：口中造作妄语、恶口、两舌、绮语等恶业。 <br/>
　　<br/>
　　3.意作恶：心里充满贪欲、瞋恚、愚痴等恶业。 <br/>
　　<br/>
　　4.悭贪：贪取妄执，不知结缘施舍。 <br/>
　　<br/>
　　5.妄求非分：不是自己份内的东西，而起觊觎非份之想。 <br/>
　　<br/>
　　6.谄曲嫉妒：谄媚邪曲，嫉妒别人比自己好，而起恶心。 <br/>
　　<br/>
　　7.起于邪见：无道德、善恶、因果报应，邪知邪见。 <br/>
　　<br/>
　　8.爱着不舍：爱恋执着心重，不能喜舍放下。 <br/>
　　<br/>
　　9.因饥而死：饥饿而死，成为饿鬼。 <br/>
　　<br/>
　　10.枯竭而死：如草木一般干枯而死。 <br/>
　　<br/>
　　佛弟子神通第一的目犍连尊者，经常来往地狱探望鬼道众生。在《佛说鬼问目连经》中，记载鬼道众生与目犍连尊者的问答，从这些问答中，可以了解鬼道众生因果受报的种种情形。 <br/>
　　<br/>
　　一鬼痛苦地问目犍连尊者：<br/>
　　<br/>
　　「尊者，我已堕落地狱，受种种痛苦的刑罚，为什么我的头还是经常疼痛欲裂呢？」<br/>
　　<br/>
　　尊者回答：「因为你过去做人时，常拿东西敲打别人的头，所以，虽然做了鬼，还要受头痛的果报。」<br/>
　　<br/>
　　另外一个鬼接着问：<br/>
　　<br/>
　　「尊者，我做鬼好可怜哟！没有房子可以遮风蔽雨，经常露宿在街头，为什么我会生活得如此悲惨呢？」<br/>
　　<br/>
　　目犍连尊者回答：「因为你过去出生在大富人家，别人要借宿你的房子，你却百般刁难，给人种种不便，因此现在做了鬼，只好餐风露宿了。」<br/>
　　<br/>
　　「尊者，我虽然做了鬼，但是我有很多的钱财。不知怎么的，我还是习惯穿破旧的衣服，这是什么原因呢？」又有一鬼提出问题。 <br/>
　　<br/>
「过去你在人间知道做善事，但是在布施之后，却又生起懊悔心。布施的功德，使你得到富贵的果报，但是懊悔的念头，使你舍不得吃穿，只能穿着破旧的衣服，过着清苦的日子。」<br/>
　　<br/>
　　大家争先恐后的向尊者讨教，旁边有一个瘦骨嶙峋的鬼，发出细细的声音问道：<br/>
　　<br/>
　　「尊者，为什么我做了鬼经常吃不到东西，饿得两眼昏花呢？」<br/>
　　<br/>
　　「你过去负责寺院库房的工作，人家给你二十块钱，你却苛扣钱财，只买了十块钱的菜，所以才有这样的业报。」<br/>
　　<br/>
　　「尊者，我做了鬼为什么还浑身疼痛，如针刺刀扎、烈火焚烧般痛楚呢？」<br/>
　　<br/>
　　「那是你过去世喜欢捕渔狩猎，杀害生灵的缘故。」目犍连尊者无限慈悲地回答。 <br/>
　　<br/>
　　有一鬼等大家七嘴八舌都问完了，才慢吞吞问道：<br/>
　　<br/>
　　「尊者，为什么我做了鬼，却不如其他的鬼那样灵巧黠慧呢？」<br/>
    <br/>
「那是因为你过去贪爱杯中物，并且经常假应酬之名，向人强行劝酒、劝肉，因此现在智慧缺乏，比较愚痴。」目犍连不厌其烦的为群鬼解答，去除了他们心中的疑团。 <br/>
　　<br/>
　　从目犍连尊者和群鬼间的问答中，我们能够明确的认识，了解鬼的因缘果报。 <br/>
　　<br/>
  </article>
</section>
)

const p2_cn = (
<section>
  <article>
　　鬼有那些种类？他们的身形又是如何？ 《阿毗达磨顺正理论》将鬼分为三类：<br/>
　　<br/>
   1.多财鬼：好比人间有大富大贵的人家一样，多财鬼享有丰富的祭祀，衣食不缺，如居住在社祠之中，受人祭拜的有主鬼，或者大势大福的天神，都属于这种多财鬼。 <br/>
　　<br/>
　　2.少财鬼：好比人间的一般平民，虽有祭祀，但是享乐比多财鬼稍为逊差。 <br/>
　　<br/>
　　3.无财鬼：好比人间居无定所，三餐不继，靠着别人赈济为生的人。无财鬼是流荡荒野的无主鬼，人们有时启荐无遮超度法会时，无财鬼就来应供，吃点美食。 <br/>
　　<br/>
　　《大毗婆沙论》则将鬼分成两种：<br/>
　　<br/>
   1.有威德鬼：身形高大，头戴华鬘帽冠，身着锦丽天衣，平日吃的是珍肴美食，出门乘坐象马拖拉的车舆，侍卫仆从围绕左右，并且有种种的娱乐生活，宛如人间的帝王天子。譬如，城隍老爷就是属于有威德鬼。 <br/>
　　<br/>
　　2.无威德鬼：头发蓬乱如草，覆盖额面，衣不蔽身，甚至裸体而行。容貌丑陋，颜色枯悴难看，走路时，手中拿着破瓦钵，好像人间的乞丐。有时我们看到衣衫褴褛、身体臭秽的穷苦人家，往往会脱口说：「这人真像鬼！」这就是无威德鬼的人间例证。 <br/>
　　<br/>
　　鬼又可分为大鬼、小鬼。大鬼身长一由旬，由旬为印度人计算度量衡的单位，一由旬大约等于二十华里，大鬼究竟有多么高大就可想而知了。大鬼的头像高山那么巨大，我们俗称为大头鬼。大鬼喉咙细小如针，经常吃不到食物，因此身体羸弱，头发杂乱不洁。由于身体长得很高大，因此都拄着拐杖行走。小鬼身体大约只有三吋长，像婴儿那么幼小。 <br/>
　　<br/>
　　鬼有美丽的鬼，也有丑陋的鬼。美鬼就像天人般的庄严好看，一点也不恐怖；丑鬼的特点是好流鼻涕，身上长满瘀脓，常常出血。鬼有富贵的鬼，也有贫贱的鬼。贵鬼如大力鬼王，受人尊敬祭拜；贱鬼如无祀孤魂，飘泊不定。 <br/>
　　<br/>
不管贵鬼、贱鬼；美鬼、丑鬼；大鬼、小鬼，乃至有威德鬼、无威德鬼，或是多财鬼、少财鬼、无财鬼，不都是人间千差万别的鲜明写照吗？因此鬼不一定存在于地狱，人间也能看到鬼道的缩影。 <br/>
　　<br/>
　　如满禅师的王姓朋友逝世了，他去为朋友诵经超度。一年之后，在他前往扬州的途中，却遇到这位朋友，如满禅师惊诧万分地问道：<br/>
　　<br/>
　　「咦？你不是早已死了吗？怎么还在这里行走呢？」<br/>
　　<br/>
　　王姓朋友赶快阻止禅师说：<br/>
　　<br/>
　　「嘘！不要喧嚷，我们到山谷再细谈吧！」<br/>
　　<br/>
　　到深山幽谷里，王姓朋友才说道：<br/>
　　<br/>
「禅师，坦白告诉你，我现在是鬼不是人，由于我过去在人间没做过什么坏事，并且富有正义感，为人有侠气，再加上你的法力超度，因此阎王老爷派给我巡察鬼的差使。」<br/>
　　<br/>
　　「哦！巡察鬼都做些什么事呢？」<br/>
　　<br/>
「人间如果有贪官污吏、奸商巨贾，我就把他们的罪行一一详记下来；不管什么大斗小秤、杀盗淫掠的勾当，我都要一五一十报告阎君，总有一天，叫他们有债还债，杀人偿命，接受果报惩罚。」<br/>
　　<br/>
　　王姓朋友说完后，从怀中掏出一朵红色的鲜花，送给如满禅师，感谢他昔日超度救拔的恩泽。禅师看了婉拒说：<br/>
　　<br/>
　　「我是个和尚，要这朵花做什么？」<br/>
　　<br/>
　　「这朵花不同于一般的花，你拿在手上，可以辨别什么是人，什么是鬼？」<br/>
　　<br/>
　　「手中拿这朵花，我如何知道谁是人，谁是鬼呢？」<br/>
　　<br/>
「只要你拿着这朵花在街上走，正人君子，瞧也不瞧花一眼。相反地，鬼就会目不转睛的盯着这朵花。假如对方看到花就搔首弄姿，这是个虚荣鬼；假如对方不但看花，还注视着人的话，那一定是个好色鬼；如果看到了花，又看看自己，可以判断这是贪心鬼；如果看了花，然后直搓双手的，那就是占便宜鬼了。」<br/>
　　<br/>
　　禅师和朋友互道珍重后，手中拿着花走在大街上，对面来了一个人，昂首阔步地擦身而过，目不斜视，如如不动不瞧花一眼。 <br/>
　　<br/>
　　「嗯！这是个正人君子。」<br/>
　　<br/>
　　再走几步，碰到一位穿着入时，打扮得珠光宝气的女子，直往花儿瞧。 <br/>
　　<br/>
　　「这是个虚荣鬼。」<br/>
　　<br/>
　　走了一段，迎面走来一位衣冠楚楚的翩翩公子，不但看花，还死盯着禅师瞧，失望地说：「唉！是个老和尚。」<br/>
　　<br/>
　　「哼！原来是个好色鬼。」禅师不悦地喃喃自语。 <br/>
　　<br/>
　　继续走了没多久，看到一个人一会儿看花，一会儿看自己。 <br/>
　　<br/>
　　「喔！是个贪心鬼。」如满禅师拐了个弯，走上了另一条街道，一个人从老远看到禅师的红花，就直搓着双手不放。 <br/>
　　<br/>
　　「哈！碰到了个占便宜鬼。」<br/>
　　<br/>
不久禅师回到了寺门口，心想这朵花不适合带到寺里去，随手往身后一丢，一脚正要跨进寺里时，忽然听到后面有吵闹的声音，回头一看，原来刚才在路上遇到的鬼魅都跟来了，你抢我夺的，争着抢那朵被丢弃在地上的红花。最后，其中一个鬼，抢到那朵花，禅师仔细一看，这那里是美丽的花朵，只不过是一根死人的臭骨头。 <br/>
　　<br/>
　　在花花世界里，有时我们费尽心机，用尽手段，努力去争取而来的名利富贵，到头来所得到的是什么？所留下的又是什么呢？还不是黄土一抔、朽骨一堆。古德说：「今日不知明日事，那有工夫计是非。」人生该争的不是浮华不实的鲜花，而是血汗所凝成的甘果。 <br/>
　　<br/>
  </article>
</section>
)

const p3_cn = (
  <section>
<article>
　　人类住在娑婆世间，在地球上面，鬼住在什么地方？人类的生活里苦乐参半，鬼有什么苦乐呢？ 《大毗婆沙论》说：富贵的鬼住山谷里、海水边、半空中、树林里，或者是人们祭祀的灵庙祠堂，并且都盖有富丽的宫殿，好比人间有的住在尘嚣闹市的高楼大厦，或是山明水秀的豪华别墅一样。贫贱的鬼住在荒郊野外的墓冢里，或是纠葛漫长的草木堆、污秽肮脏的屎粪茅厕、荒废无人的古宅废墟里。 <br/>
　　<br/>
　　鬼的生活，有过得很艰苦的，也有过得很快乐的。苦鬼常常感到饥肠辘辘、干渴难忍，经年累月听不到浆水米粥的声音，纵然遇到了河水，也无法享用。双手捧起清水，正要喝时马上变成熊熊的火焰，即使喝入咽喉，也被焚烧焦烂，再甘美的食物祭拜他，都无法救他的累劫饥渴。如果真有诚心救度，可以备办简单的素果菜茗，以佛门的诵经持咒、神力加持去其咽喉火焰，还有实际的功德利益，切忌再为亡魂杀生；三牲齐备，只有增加他的罪业。 <br/>
　　<br/>
　　《地藏经》说，为鬼魂诵经超度的功德，活着的人可以得到七分之六，而亡者只能得到七分之一。因此人生在世，应该趁着身强体健时，多为自己行善积些功德，否则等到两腿一伸，才要劳驾别人为我们超度就太迟了。 <br/>
　　<br/>
　　乐鬼的生活每天丰衣美食，驱驾车乘，飞驰自如，任情游戏享尽快乐。乐鬼的享乐虽然胜于人间，但是总比不上人间好，并且他们胆量非常小，昼伏夜游，白天不敢出来行动，有亮光的地方也不敢出现。纵然出来活动，碰到了人，也是胆怯畏惧，闪避在角落阴暗处，怕被人撞着。鬼如此的惧怕我们，人类大可不必谈鬼色变。 <br/>
　　<br/>
　　谈到鬼的生活，我们人类由于无知执迷，有时往往干涉到鬼的生活自由。在台湾的民情风俗里，有娶死人的牌位回来做妻子的陋习。有一对父母硬要把已经死去几年的女儿嫁给一位青年。这个女儿活着的时候，为了争取爱情自由不果而死亡。现在父母还要强迫她，亡魂很不高兴：<br/>
　　<br/>
　　「爸妈，我在世时，你们不给我感情的自由。现在我死了做鬼，还强迫我嫁人。」<br/>
　　<br/>
　　这女孩也觉得这位青年没有出息，不去迎娶活人，偏要讨个鬼做老婆，于是故意捉弄他。洞房花烛夜的晚上，这儿打他一记耳光，那儿打他一下脸颊，整个晚上新郎官没有见着新娘子，耳光倒是挨了不少。青年被打得鼻青脸肿，第二天清晨赶快叫人把牌位退回去。 <br/>
　　<br/>
　　为什么要做这种愚痴的事呢？把牌位讨回家，和女鬼同榻而眠，不是人间奇闻吗？台湾民间还流行烧汽车、洋房、美钞、电视、电冰箱等现代用品给亡者的风气。其实，鬼具有五神通，他想到那里去，运用神足通，马上就能到达目的地。如果鬼真的乘坐汽车，还要发动引擎，反而嫌慢。何况如果人人都烧汽车，地狱的交通不是要大为混乱，车祸频传了吗？我们所用的电视、电冰箱等家用电器，电压的度数有220V或110V，不知道地狱适用不适用？美钞虽然是世界通用的货币，但是美钞拿到世界某些国家还是无法兑现的，在阴间美钞也是行不通的。 <br/>
　　<br/>
　　鬼有他们自己的生活方式，我们不必为他们操心，亲人过世了，也不要以为他一定会变成鬼。我们纪念祖先，不必花一把钞票买一堆金银纸，把可贵的金钱付之火炬，变成没有意义的灰烬。我们可以用祖先的名义设立奖学金，作育天下英才，或者捐献给社会公益事业，兴学办校，印行善书，让祖先能够遗爱人间，留芳万世。 <br/>
　　<br/>
　　关于鬼生活的苦乐情形，中国古书里有一段精彩绝伦的记载。有位刚死不久的鬼，老是找不到食物，他干瘪着肚子到处飘荡，碰到了一个老鬼，老鬼就说：<br/>
　　<br/>
　　「喂！你怎么面黄肌瘦，一脸憔悴呢？」<br/>
　　<br/>
　　「我做鬼已经好几天，一直都没有东西吃，怎么不消瘦呢？老兄，你做鬼比较有经验，能不能告诉我如何才能改善生活。」<br/>
　　<br/>
　　「那还不简单，像我们这一类，只要装神弄鬼一番，就有办法啦！」老鬼倚老卖老地传授锦囊妙计。 <br/>
　　<br/>
　　新鬼恍然大悟，于是跑到城东一户穷人家里。那户人家正在磨面粉，他一进去就替他们推磨子，磨起面粉来。这一家人看了大叫：<br/>
　　<br/>
　　「这磨子没人推，怎么自己动起来了呢？也许是佛菩萨慈悲，可怜我们家里贫穷，派个鬼来替我们推磨吧。」<br/>
　　<br/>
　　这新鬼从初更一直推到天亮，推得精疲力尽，两眼昏花，却一点东西也没有吃到，就怒气冲冲地跑去找老鬼：<br/>
　　<br/>
　　「喂！老兄，你叫我装神弄鬼就能改善生活，可是昨晚我去替城东的人家推了一夜的磨，却什么东西也没吃到。」<br/>
　　<br/>
　　「哎哟！你真糊涂，你去的那户人家是信奉佛祖的，他们有正信，不怕鬼，怎么会给你东西吃呢？」<br/>
　　<br/>
　　「好！那我今晚到城西换一家。」<br/>
　　<br/>
　　新鬼趁夜色迷蒙赶到了城西，找了一家舂米的，趁着人们休息时，拿起棒子，兀自舂捣了起来。这家人看了都啧啧称奇：<br/>
　　<br/>
　　「唷！昨夜佛祖慈悲叫鬼到城东去推磨；今天祖师爷显威，也叫鬼到咱们家来舂米。」<br/>
　　<br/>
　　新鬼卖力地舂到天明鸡啼，腰酸背痛，浑身无力，还是没有吃到任何东西，便气愤不已地回去找老鬼算帐：<br/>
　　<br/>
　　「你倒说说看，这一家人为什么也不给我东西吃呢？」<br/>
　　<br/>
　　「老弟，这一家是信仰道教的，他们不但不怕鬼，还要抓鬼呢。」<br/>
　　<br/>
　　「那我怎么办呢？」<br/>
　　<br/>
　　「你去找一户没有供奉佛像或是神明的人家，就万事可行了。」<br/>
　　<br/>
　　新鬼努力的寻找，终于找到一户什么也没有供奉的人家。一脚跨进去，一屋子人围着香喷喷的鱼肉酒菜大吃大嚼。新鬼看得垂涎欲滴，不知如何装神弄鬼，突然看到桌脚下蹲着一只瘦瘦的狗，摇尾乞怜地等待主人丢下的骨头。新鬼一把抓起狗，在空中迅速的飞行。 <br/>
　　<br/>
　　「不得了啦！这只狗怎么会在空中飞行？中了什么邪吗？」<br/>
　　<br/>
　　一家人乱了手脚，有人提出意见找耶稣来帮忙，有人马上否定说：<br/>
　　<br/>
　　「耶稣有办法感化人，这是鬼，他没有办法的。」<br/>
　　<br/>
　　又有人建议：<br/>
　　<br/>
　　「我们读圣贤书，应该尊重孔老夫子，我们请夫子来帮忙吧！」<br/>
　　<br/>
　　「你难道忘了，孔夫子叫我们敬鬼神而远之，何况夫子本人还不语怪力乱神，求他是没有用的。」有人振振有词地反对。 <br/>
　　<br/>
　　大家你一言、我一语，不知如何是好？最后终于决定找神坛的乩童来做法：<br/>
　　<br/>
　　「这是鬼魂在作祟，你们赶快把这条狗杀了，并且备办丰盛的三牲酒菜来祭拜，这鬼就服服贴贴了。」<br/>
　　<br/>
　　这家人赶忙依言办了一桌酒席来祭鬼，鬼饱餐一顿，从此食髓知味，再也不肯离开，天天上门作怪讨吃，这就叫做「引鬼上门」。 <br/>
　　<br/>
　　我们为人处世要堂堂正正、光明磊落，千万不要引鬼上门。譬如有的人结交地痞流氓、黑道杀手，只要找他们帮一次忙，和他们搭上了线，将来就会麻烦无尽，甚至把生命都赔上。台湾民间，各地都有拜好兄弟的陋习，把这些邪魔外道引进自己的家门，还将他奉为上宾，将来势必会惹祸上身。我们要尊敬有道有德的人，尊敬正派、有学问的人，和这些魑魅魍魉泾渭分明，互不来往，如此必能永保康泰平安。 <br/>
　　<br/>

</article>
</section>
)

const p4_cn = (
  <section><article>
      宇宙间，十法界各有他们的世界，佛有佛的世界，譬如东方琉璃世界，西方极乐世界；天神有天神的世界，譬如三界二十八天；人有人的世界，譬如三大洋五大洲，人类有种族、身体、富贫、智愚等种种差别；畜生有畜生的世界，譬如天上飞的鸟、地上走的兽、海里游的鱼等，种类繁多。同样的，地狱饿鬼也有他们的世界。鬼的世界和人一样，有他们自己的眷属，并且还须要工作谋生，鬼的社会也有贫富贵贱的差别，彼此之间少不了是非恩怨。鬼的性格千差万别，有脾气暴躁的，有性情凶残的，当然也不失温驯善良的。 <br/>
    　　<br/>
    　　其实，鬼的存在和我们的人生有很密切的关系，因为在我们的人间到处充满着鬼。什么是人间的鬼呢？有不良习惯的都名之为鬼。譬如喜欢吞云吐雾，烟嘴不离口的叫烟鬼；贪爱杯中之物，每天喝得醉眼醺醺的叫酒鬼；沉迷方城之战，赌得天昏地暗的叫赌鬼；恋眷朱颜女色，耽溺不知自拔的叫色鬼。我们常将一些坏的名词加在鬼的身上，举凡有恶劣的性情、不良行为的，我们就称之为鬼，例如懒惰鬼、胆小鬼、疑心鬼、嫉妒鬼、小气鬼、贪心鬼、吝啬鬼、淘气鬼、缺德鬼，甚至剥削民脂民膏的吸血鬼等等，谁说人间没有鬼呢？ <br/>
    　　<br/>
    　　我们只知道请法师道士来超荐阴间的鬼，却不知道人间的鬼更需要度化。阴间的鬼超荐了，就可以夜行不惊，宅第平安；人间的鬼度化了，就可以民风转善，社会祥和。如何来度化这些人间的鬼怪呢？佛教的三皈、五戒、六度、十善，就是超度人间鬼怪的法门。 <br/>
    　　<br/>
    　　譬如三皈依，皈依佛宝永不堕地狱，皈依法宝永不堕畜生，皈依僧宝永不堕饿鬼。受持了五戒，不杀生、不偷盗、不邪淫、不妄语、不饮酒，从此远离罪恶渊薮，不再种植堕落地狱的种子，当然就不会沦为恶鬼了。目前的社会人心浇薄，道德沦丧，如果我们不幸染上恶鬼的习性，赶快痛下决心来接受佛法的治疗，多多提倡善良的风气，提高民众的知识教育，提升社会的道德水准，把这些在鬼门关里游荡的鬼，早日解救出来。 <br/>
    　　<br/>
    　　我们应该共同净化这个社会，使社会没有鬼的存在，每一个都是顶天立地的人，都是悲智双运的佛。每一人都能转鬼性为佛性，化凡心为佛心，如此，我们的人间就是人间净土，而不是人间炼狱。
    </article>
  </section>
)

const p1_en = (
<section>
  <article>
{["In this world, there are good people and bad people. In the world of ghosts, it is the same. There are good ghosts and bad ghosts. Even though there are bad people in this world, good people outnumber them by quite a lot. It is the same with ghosts. There are some very evil ghosts, but most ghosts are good ghosts. People, sometimes, are much worse than ghosts. Human begins sometimes will do things no ghost would ever consider doing.",

  "In Nanyang there once was a man named Song Dingbo. One night Song was hurrying home when suddenly he saw a ghost. Song acted as bravely as he could and asked, \"Who are you and why are you walking so strangely?\"",

  "\"I am a ghost, that is why. Now, who are you?\" the figure answered.",

  "Song was frightened to hear the ghost's reply, and he was even more afraid to admit that he was a human being. Might not the ghost harm him if he admitted that? In a moment's inspiration, Song decided to do what human beings do best--lie. \"Oh! I am a ghost too,\" he said.",

  "\"You are a ghost, too, are you? Well, where are you going?\"",

  "\"I am on my way to the city,\" Song replied.",

  "\"Great,\" the ghost said, obviously pleased to hear that. \"I am on my way to the city, too. Let us walk together.\"",

  "Song had no choice but to accept the invitation. With great trepidation he fell in behind the ghost to walk to the city. After a while, when they both began to show signs of fatigue, the ghost turned and made a suggestion. \"The city is still far away,\" he said, \"Walking like this is tiring. Let us take turns carrying each other instead. That way we can still make good progress and one of us with be able to rest. What do you think about this?\"",

  "\"This is a good idea,\" Song said.",

  "\"Okay, I will carry you first.\" With that, the ghost hoisted Sung onto his back. \"Wow! Are you ever heavy! How did you get so heavy?\" the ghost asked.",

  "Ghosts have no definite form and no weight. They are kind of spirit or a kind of energy (chi). They can pass through walls and become invisible at will. So, to a ghost, a human being is very gross and heavy.",

  "As soon as Song heard the ghost's question, he made up another lie. \"I am so heavy,\" he said, \"because I died just recently.\"",

  "The ghost believed Song and they continued to travel along with the ghost carrying Song.",

  "After a while, they came to a river. The ghost stopped and said, \"We better swim across here.\" With that he dove into the water and, with the grace of a cloud flying through the air, swam to the other side. When the ghost got to his feet and turned around, he saw Song still struggling in the middle of the river, splashing the water and panting very loudly. Gradually, Song got closer. When he reached the reached the bank, the ghost hurried over to ask him, \"Why do you make so much noise when you swim? You will scare everybody around here!\"",

  "Song could see that the ghost was getting suspicious of him so he used his best trick and repeated his lie from before. \"I just died, so I really have not learned to swim yet,\" he said.",

  "The two started for town again. As they walked, Song thought to himself, \"This is a bad night for me. Here I am walking along with a ghost. I have to think of some way to get away from him!\" In an innocent manner, Song asked the ghost, \"Friend, I just died, and I am not all that clear about the world of ghosts. You have much more experience than I do. Tell me, what is the most frightening thing for us ghosts? What do we most need to watch out for?\"",

  "\"Human saliva,\" the ghost replied. \"If a human being ever spits on a ghost, that ghost has had it. There is nothing he can do to save himself.\"",

  "The ghost was candid with his reply. Above them the sky was slowly starting to take on a shade of silvery gray. Dawn was approaching. The two were now close to the city.",

  "Song waited for a chance when the ghost was not looking, and spit a large gob of spittle on the ghost's back. Immediately, the ghost began to twist and turn. Then he fell to the ground, writhing in agony before he completely disappeared. In his place stood a small mountain goat. Song took the goat into town and sold him for a good price.",

  "This little story displays well the cruelty and deceitfulness of human beings. Sometimes ghosts are willing to help us, but we replay them with striking them with such cruel force. It really is true that sometimes people are much worse than ghosts.",

  "Evil ghosts capable of harming human beings do exist, but if we are moral and kind throughout our lives, they can do us no harm. There is a Chinese saying that applies well here, <i>\"If we do no evil during the day, we need not worry about evil ghosts knocking on our doors at night.\"</i> The ghosts outside of us are not nearly as frightening as the ghosts inside of us.",

  "Once there was an old monk who was just sitting down to meditate when a a ghosts with unkempt hair and wild eyes appeared before him, trying to disturb his peace of mind. The old monk looked at him and said, \"Oh my, what is this? What a mess! Look at that hair, and those eyes! You are really in no shape to be visiting people!\"",

  "When the ghost saw that he had failed to frighten the monk and was being admonished instead, he screwed up his face, bared his sharp teeth and stuck his long tongue far outside his mouth.",

  "The monk only said in reply, \"What is so great about that? Your face is the same as mine; it is only a little paler and you teeth are sharper and your tongue is longer. That is all.\"",

  "When the ghost saw that once again he had failed to scare the old monk, he changed his appearance again. He made his eyes and his nose disappear. Then he made his hands and feet disappear. However, the monk stayed the same, behaving as if nothing special were happening.",

  "\"My, you are pitiful!\" he said. \"You have no eyes, nose, hands or feet. I really feel quite sorry for you!\"",

  "With this response, the ghost at last gave up trying to scare the monk and disappeared. When the old monk saw the frightful appearance of the ghost, all he felt was compassion for him for having accumulated such bad karma to be turned into a ghost. Mercy has no enemies. In the face of compassion, all perverse and evil forces melt into nothingness.",

  "We all know that people fear ghosts, but, actually, ghosts fear people much more than people fear ghosts. When ghosts see people, they run as far away as they can. They behave the same way wild animals do when they see people: they run and hide. Ghosts never come out during the day; they always wait until nighttime because they fear people so much that they come out only when the fewest people are around. Once this is understood, seeing a ghost should not be a cause for panic. Ghosts exist in a different realm than humans and their karma has nothing to do with them.",

  "The <i>Records of Hell</i> contains a story about a man named Yuan Deru who got up in the middle of the night to go to the bathroom. In the bathroom, Yuan suddenly saw a giant ghost standing quietly in front of him. The ghost had enormous eyes and a black face. He was wearing a long white robe. The two looked steadily at each other for a while. Then Yuan broke into a laugh and said, \"People have always told me that ghosts have ugly faces. Now I can see for myself that they are right!\"",

  "When he heard Yuan say this, the ghost felt so embarrassed his ears and face turned red and he had to leave. Sometimes a ghost's sense of shame can be even more developed than a human being's. If humans are clear in their minds about what constitutes good and bad, and always try to behave in the right way, no ghost will ever dare interfere in their lives.",

  "There are reasons why ghosts exist. There are certain kinds of karma that cause people to become ghosts. The <i>Buddhist Karmic Rewards Sutra</i> gives ten reasons\:",

  "1) The body has committed evil. One has killed, or stolen, or indulged in other evil behavior.",

  "2) The mouth has committed evil. One has repeatedly lied, slandered, or spoken with great harshness. One has indulged in idle, thoughtless talk.",

  "3) The mind has committed evil. One's thoughts have been full of greed, hatred, ignorance or other defilements.",

  "4) Greed. Once has ben greedy and grasping and not understanding of the value of giving.",

  "5) Covetousness. One has been envious and wanted things that do not belong to oneself.",

  "6) Fawning and jealousy. One has often been jealous of other people and thus created evil thoughts.",

  "7) Perverse ideas. One has denied the value of morality and the difference between good and bad.",

  "8) Attachment and not letting go. One feels strong attachment and clinging in one's mind and cannot joyfully let go.",

  "9) Dying of starvation. People who starve to death become hungry ghosts.",

  "10) Dying of thirst. People who die of thirst become ghosts.",

  "One of the Buddha's greatest disciples, Mahamaudgalyayana, often traveled to hell to ask the ghosts there about their conditions and about the causes that had sent them to hell. In the <i>Mahamaudgalyayana Sutra</i> there is a fascinating record of one of the Mahamaudgalyayana's conversation with the ghosts in hell. From their exchange, one can see how the law of cause and effect works. At one point a ghost asked Mahamaudgalyayana, \"Venerable One, I have fallen into the ghost realm and I suffer all kinds of pain and punishment. Why does my head always hurts so much? It feels like it is about to split open!\"",

  "Mahamaudgalyayana answered him, \"When you were a human being you often hit other people on their heads. For this reason you not only have become a ghost, but you also have to endure those terrible headaches.\"",

  "Then another ghost begged him, \"Venerable One, I am a ghost and my life is miserable! I have to sleep out from the wind and rain. Why do I have to suffer like this day after day?\"",

  "Mahamaudgalyayana answered, \"In you last human life you were very wealthy and you had a beautiful home, but you never helped others. Instead, you only made it difficult for anyone in need of shelter. Therefore, you ended up suffering, sleeping outdoors in the cold and rain now.\"",

  "Then another ghost asked, \"Venerable One, now that I am a ghost I still have lots of money. Yet, it is strange because I never spend any of it. I just walk around in old patched clothes all the time. Why is that?\"",

  "Mahamaudgalyayana answered him, \"When you were a human being, you were often generous with others but after giving something away, you always had second thoughts for having been kind. Your generosity in that life is the cause for you having wealth now, but you wavering has made you live like a poor person.\"",

  "As all the ghosts crowded around Mahamaudgalyayana to learn more from him, a sallow, emaciated ghost standing alone at the edge of the group slowly intoned in a long quavering voice, \"Venerable One, I am a ghost, but I can eat nothing! Why is that? I am so hungry that I feel dizzy all the time! Why is that?\"",

  "Mahamaudgalyayana answered, \"When you were a human being you worked in the kitchen of a temple, and in that position you often stole money which had been donated for food. If a devotee gave you twenty coins, you would keep ten for youself and use only ten to buy food for the kitchen. The result of those actions is that now you have to go hungry yourself.\"",

  "\"Venerable One,\" another ghost complained in desperation. \"Now that I am ghost, I suffer so much pain. My body hurts all the time as if it were being poked with needles and slashed with knife blades. I feel as if I am being burned in a fire. Why do I have to suffer so much?\"",

  "\"When you were a human being you often caught fish and hunted animals. You killed so many creatures that you have to suffer their pain now,\" Mahamaudgalyayana said, answering him with great compassion.",

  "When the ghosts at last began to fail silent and reflect on Mahamaudgalyayana's words, one of them in a halting and uncertain tone asked, \"Venerable One, why have I become a ghost who is so slow at thinking? I am so stupid compared to these other ghosts who all posses quick minds. Why is that?\"",

  "\"Because when you were a human being you loved to indulge yourself in alcohol. On social occasions you often encouraged people to drink alcohol and to indulge in meat, so now you are a little slow in your thinking and not as nimble as the other ghosts.\"",

  "Mahamaudgalyayana patiently stayed with the ghosts until all of their questions had been answered, and then he left. From these questions and answers recorded in Buddhist sutras, we can get a pretty good idea of why some people become ghosts and what kinds of punishments fit what kinds of transgressions. Chefs and homemakers, be warned! Do not take money intended for food and keep it for yourselves, or you too might become a hungry ghost one day! If you are in business, be careful what you do! Do not think you can get away with skimming a little extra for yourself or with cheating your customers. Those who slaughter for the sake of satisfying their tastes and those who indulge in intoxicating drink, be forewarned. Do not let a moment of self-gratification cause you endless suffering and regret.",
].map((str,i)=>{
   //return <div key={i} style={{width:window.innerWidth, textAlign: 'justify', flexWrap: 'wrap'}}><p style={{textIndent: 50, margin: 0}}>{parseItalic(str)}</p></div>
   //return <div key={i} style={{textIndent: 50, margin: 0, textAlign: 'justify'}}>{parseItalic(str)}</div>
   return <div key={i}>{parseItalic(str)}</div>
})}
  </article>
</section>
)

const p2_en = (
  <section>
    <article>
  {["How many kinds of ghosts are there and what do they look like? The <i>Abhidharma-nyayanusara</i> says there are three kinds of ghosts.",

    "A. Wealthy Ghosts",
    "Wealthy ghosts are something like wealthy human beings. They enjoy a lot of offerings and they do not want for food or clothing. Examples of such ghosts include those honored in an ancestral shrine or  those revered for their great powers and blessings.",

    "B. Not-So-Wealthy-Ghosts",
    "Those ghosts are like most people in the world. Although they receive some offerings, they are less well-off than wealthy ghosts.",

    "C. Poor Ghosts",
    "These are ghosts are much like homeless human beggars. They have no place to live. Sometimes they eat and sometimes they do not. Their livelihood depends largely on handouts from others. For the most part, these poor ghosts wander around alone in very remote parts of the world. Only when there is a special offering made for them in the temple can they get something to eat. The <i>Abhidharmamahavibhasa-sastra</i> says that there are two kinds of ghosts.",

    "A. Ghosts with Dignity and Prominence",
    "These ghosts are strong and tall. They wear ornate headpieces, flower garlands, and beautiful clothing. They eat delicacies and ride in carriages pulled by horses or elephants. They have servants who care for them wherever they go and they live lives full of pleasure and amusement. They are much like royal people in the human realm. The Chinese folk god, Cheng Huang Lao Ye, is this kind of ghost.",

    "B. Ghosts Lacking in Dignity and Prominence",
    "These ghosts have messy hair that flies all over and covers their faces. Their clothing is ragged, at best, and often they are forced to go completely naked. Their faces are pale and ugly. They carry old broken begging bowls. They are very similar to downtrodden beggars in the human realm.",

    "Ghosts can also be divided into the general categories of large and small ghosts. Large ghosts are about one yojana tall, based on the Indian measurement units. One yojana is approximately seven miles. Imagine that! They are huge creatures. In Chinese, they are sometimes called \"Big-headed\" ghosts because their heads are as big as mountains. However, their long throats are as narrow as needles and, for the most part, they are unable to eat anything. For this reason, they are very weak and they have to use canes whenever they want to walk somewhere. Their hair is long and messy and dirty. In contrast, small ghosts are very tiny. They are about as big as newborn babies.",

    "There also are beautiful ghosts and ugly ones. Beautiful ghosts are so beautiful they look like heavenly beings and are not in the least bit frightening. Ugly ghosts are remarkable, especially for their runny noses and the sores all over their bodies, which constantly bleed and emit noxious pus. There are noble wealthy ghosts and lowly impoverished ones also. Noble ghosts, like the Ghost King of Great Strength, are venerated by people. Lowly ghosts are orphaned ones who wander from place to place.",

    "Whether ghosts are wealthy or poor, beautiful or ugly, with or without Dignity and prominence, large or small, they all are representative of human beings in some way, and they do not all live in hell. Are there not visible signs of them in this world?",

    "Zen master Ruman once had a friend named Wang. When Wang died, Master Ruman held a special Dharma service, chanting sutras to help him in the next rebirth. A year or so after Wang's death, Master Ruman set out for Yangzhou in Jiangsu Province. While he was on the road, Master Ruman suddenly saw his old friend Wang standing in front of him. Master Ruman was astonished at the sight of him and asked, \"Did you not die already? How is it possible that you are here now walking around?\"",

    "Wang quickly interrupted the Master. \"Hush, do not talk so loudly. Come with me into the mountains and we will discuss everything in detail.\"",

    "When the two at last got to a remote mountain gorge, Wang said, \"Master Ruman, let me tell you now. I am not a human being. I am a ghost. When I was a human, I never did anything bad and I often tried to help other people. In addition to that, there were all those sutras you chanted for me after I died. Now King Yama of Hell has appointed me to be an investigator for him in the human realm.\"",

    "\"Amazing! So, what do you do as a ghost investigator?\"",

    "\"It is my job to make a detailed record of human acts of corruption, murder, theft, depravity and cruelty. I record everything I see and report all of it to King Yama. He keeps these records and makes sure that all transgressions are repaid in kind. People who murder will experience being murdered. People who steal will someday have thing stolen from them, and so on.\"",

    "After Wang finished speaking, he reached into his clothing and pulled out a red flower to give to Master Ruman as a token of payment for the kindness Master Ruman had shown him when he was still a human being. When Master Ruman saw the flower, he tried to refuse it. \"I am just a monk.\" He said. \"What do I need this flower for?\"",

    "\"This flower is not like other flowers,\" Wang said. \"If you carry it in your hand, it will allow you to tell if someone is a human being or a ghost.\"",

    "\"How will carrying a flower in my hand help me do that?\" Master Ruman asked.",

    "\"If you have this flower in your hand as you walk down the street, a righteous person will never look at it. Ghosts, however, will stare at the flower with great intensity. If an individual stares at the flower and then makes gestures to attract attention, then you will know that this individual is a <i>show-off ghost</i>. If a ghost looks at the flower and then looks at you, you will know that he is a <i>lustful ghost</i>. If the ghost looks at the flower and then looks at himself, then you will know that he is a <i>greedy ghost</i>. If a ghost looks at the flower and then starts rubbing his hand together, you will know that he is a <i>cheating ghost</i>.\"",

    "After Master Ruman and Wang had parted company, Master Ruman walked into town carrying the red flower in his hand. The first person who came toward him sauntered along contentedly, never once glancing at the flower. \"Good, that must be a righteous human being,\" Master Ruman thought to himself.",

    "He walked a little farther and saw a very fashionable woman dressed in beautiful clothes. She stared directly at the flower, and patted her cheek.",

    "\"Oh no, that must be a <i>show-off ghost</i>,\" Master Ruman thought.",

    "After a while, a man, also dressed very well, walked toward Master Ruman. He stared at the flower, turned his eyes to Master Ruman, and said disappointedly, \"This is only an old monk.\"",

    "\"Oh no, he is a lustful ghost!\" the Master muttered to himself, somewhat displeased.",

    "Master Ruman kept walking and before long another person approached himself. This one stared at the flower and then at himself. \"Oh no,\" Master Ruman thought. \"He is a greedy ghost!\"",

    "Master Ruman turned and started down another street. Far down the street someone started staring at the flower and rubbing his hands together. \"Oh no, now I have run into a cheating ghost. This flower is really powerful. Look what it is showing me!\"",

    "Master Ruman walked some more and thought about what he had just seen. Before long, he found himself at the gate of his temple. Thinking it would be inappropriate to bring the red flower into the temple, Master Ruman threw it on the ground behind him and started to enter the temple gate. In seconds, he heard a lot of noise and arguing going on behind him. He turned and saw that all the ghosts he had just seen in town and had been following him. Now they were fighting over the flower he had thrown on the ground. At last, one of the ghosts prevailed in the fight and held the flower in his hand. As the other ghosts stopped to look at it, Master Ruman saw that the beautiful red flower had turned into a mere bone from some dead body.",

    "In this world, sometimes people try so hard to attain wealth, fame or power, but in the end what do they really get? Is it not just like that story? In the end, they are left holding nothing but a pile of old bones and a handful of dirt.",

    "There is an old Buddhist saying, \"Today I know nothing of tomorrow: Why should I waste my time on disputes and discord?\" Therefore, people should not fight over the flowers of superficial glory and vanity in life, but should honestly and diligently work toward meaningful goals in life.",

  ].map((str,i)=>{
    //let italicized = parseItalic(str)
    //  return <div key={i} style={{width:window.innerWidth, textAlign: 'justify', flexWrap: 'wrap'}}><div style={{textIndent: 50, margin: 0}}>{parseItalic(str)}</div></div>
    // return <div key={i} style={{textIndent: 50, margin: 0, textAlign: 'justify'}}>{italicized}</div>
    return <div key={i}>{parseItalic(str)}</div>
  })}
  </article>
</section>
)

const p3_en = (
<section>
  <article>
  {["Human beings live on the earth in the human realm. Where do ghosts live? In human life there is pleasure and pain. What gives ghosts pleasure and pain?",

    "The <i>Abhidharmamahavibhasa-sastra</i> says that wealthy ghosts live in mountain valleys and gorges, on the coasts of the world's oceans, in the air, in forests or in temples where people worship them. They are like people who live in penthouses in cities or in luxurious resorts in the picturesque countryside. Poor ghosts live in remote areas near graveyards, or in piles of grass and wood, or in latrines, or in deserted areas. Poor ghosts do not have homes for themselves, but usually wander around like human beggars, completely exposed to the natural elements of wind and rain. They are mired in anguish.",

    "Some ghosts suffer a great deal and some of them actually have quite a lot of fun. Suffering ghosts experience terrible hunger and unbearable thirst. They never have anything to eat and even if they see a river, they cannot drank from it. If ever they do take water from a river to drink, it will instantly turn into flames in their throats. Even the most delicious food offerings are useless in relieving their perpetual hunger. If you want to help these beings, you may offer them a simple meal of fruits and vegetables in a Buddhist ceremony. Through the merits and blessings of the Buddhist sutras and mantras, the burning fire in their throats may cease, thereby allowing them to eat. Definitely do not offer them sacrifices, otherwise, you will only increase their evil karma and suffering.",

    "The <i>Ksitigarbha Sutra</i> says that, of the merits in chanting sutras and making offerings for the ghosts, six out of seven parts will benefit human beings while only one in seven parts will benefit the deceased. From this we can see how important it is to use our time here while we are healthy to do as much as we can. If we wait until we are dead and our bodies are stretched out and stiff, then it will be too late to do anything for ourselves, and other people will not be able to do us much good either.",

    "Happy ghosts live pleasant lives full of good food and beautiful clothes.  They have vehicles to take them wherever they want to go and they generally pass their time pleasantly. Happy ghosts have it pretty easy because when they were alive, they were generous towards others. They became ghosts, though, because they often regretted their generosity or felt stingy in their hearts. Even though the life of a happy ghost is more pleasant than the life of a human being, it is still much better to be a human being. These ghosts are very timid and only dare to come out late at night. They are afraid of light and never appear during the day. If they happen to come across a human being, they run and hide in dark places because they are afraid to touch people. Once it is understood how deeply ghosts fear human beings there will be no need to feat ghosts so much.",

    "Sometimes human beings unintentionally disturb ghosts. In Taiwan, there is a folk custom of \"marrying\" a dead daughter (so she will have a place on someone's ancestral shrine). There is a story about a couple that tried very hard to find someone to \"marry\" their daughter who had died before she was married in life. The daughter had not married in life because she did not want to, and their forcing her to do so after death only angered her and caused her more misery.",

    "\"Father, Mother,\" she said. \"when I was alive you tried to force me to marry to carry on the family name and now that I am dead and have become a ghost, you still want to force your will on me!\"",

    "Since the ghost thought this young man was good-for-nothing in wishing to \"marry\" a ghost, she intentionally caused her \"husband\" a lot of trouble. On the \"wedding night,\" she came and hit her \"husband\" on the head, boxed his ears and struck him in the face. She continued to push and hit him all night long. The \"bridegroom\" never once caught sight of his \"bride,\" but when the morning came, his face was swollen from being punched so often. The next day he took her name away from his family shrine and returned it to her parents.",

    "Why do people do such ignorant things? How strange a man would consider sleeping with a ghost and putting her name in his family shrine. What good could that ever bring? In Taiwan, some people also have the custom of burning paper representations of automobiles, houses, American dollars, television sets, refrigerators and other things so that these items will go to the ghost realm where they departed loved ones can enjoy them. (The smoke is thought to carry them to the ghost realm.)",

    "The truth is, ghosts have five types of magical powers, and they can move around by just thinking of where they want to go. They do not need cars. If they did use cars, it would take them longer than if they had gone by their own powers. If everybody burned a paper car for their loved ones, pretty soon hell would be overloaded with automobiles. There would be traffic accidents and no one would every get anywhere. In his human realm, home appliances are either 110 volts or 220 volts. If they do not have the right outlets in hell, our appliances will be useless there. American dollars are used almost all over the world, but do you think they will also be accepted in hell?",

    "Ghosts have their own ways of living and we do not need to be too concerned with them. A loved one who has passed away may have gone to heaven or been reborn as a human being. You can not be sure they have become ghosts and their lives are full of sorrow and need. If we are going to honor our ancestors, we do not need to burn paper money for them because we will only end up with a heap of useless ashes. It would be much better for everyone to donate money in the names of our ancestors. We can build schools, establish scholarship funds and do other good things in their names. In this way our ancestors can make a use full contribution to the human realm.",

    "In Chinese literature, there is a wonderful and vivid story about ghosts. Once there was a ghost who had just left his human body. As a new ghost, he discovered that he was so inexperienced he could not find anything to eat. He was getting really hungry when he met an old ghost. The old ghost said to him, \"Young fellow, why are you so skinny and why is tour face so pale and gaunt?\"",

    "\"I have been a ghosts for quite a few days now,\" the new ghost replied, \"but I have not yet succeeded in finding anything to eat. That is why I look so bad. My friend, you have been a ghost for a much longer time than I have. Please tell me how to get some food!\"",

    "\"That is so easy,\" the old ghost said, \"What I usually do is play some ghost tricks and do something supernatural. That is what gets me fed!\"",

    "\"So that is how you do it.\" the new ghost said. \"Now I understand.\"",

    "The new ghost was delighted with his new understanding and immediately ran to the east side of town. He entered a poor person's house where someone was grinding flour. As soon as he had the chance, the ghost stepped up to the grinding wheel and started to move it himself. When the person in the house saw that the wheel was moving all by itself, he called out in surprise, \"Wow! The wheel is moving all by itself and no one is pushing it! There must be a ghost here! It must be our compassionate Buddha who sent him here to help us because we are so poor and have to work hard all the time!\"",

    "\"The new ghost kept pushing the grinding wheel all night long. He got very tired from the work and his eyes began to glaze over, but then dawn came he still had not gotten anything to eat. He ran straight back to the old ghost.",

    "\"Hey, you! You told me to play some ghost tricks to make my life better,\" he complained angrily. \"I followed your advice completely. I worked all night, yet I did not get one thing to eat!\"",

    "\"Oh, you fool,\" the old ghost said. \"The people in the home you went to believe in Buddhism. Buddhists are not afraid of ghosts. Why should they give you anything to eat?\"",

    "\"So that is how it is. I see. I will try another place tonight,\" the new ghost said. That night he slipped through the shadows and went to a different house on the west side of town where some people were pounding rice. He picked up the pounding stick and began pounding the rice for them. When the people saw what was happening, they were very surprised.",

    "\"Amazing! Look at that! Last night the Buddha sent a ghost to someone's home to help him grind flour, and tonight Lao Tzu has sent a ghost to help us pound rice.\"",

    "The new ghost worked as hard as he could until dawn and he heard rooster crowing. His back and arms were terribly sore and he felt tired all through his body, but still he had not been given a single thing to eat. He raced back to the old ghost, more than a little bit angry this time.",

    "\"Now, try to explain this to me. Why did they not give me anything to eat? I do not understand!\"",

    "\"My young friend, those people were Taoists. Not only do they not fear ghosts, sometimes they even try to catch them!\"",

    "\"Then what should I do? Do I have to go hungry day in and day out? I can hardly bear it!\"",

    "\"Here is what you do,\" the old ghost said. \"Find a house without any Buddhist statues or signs of Taoist gods. In that place, anything will be possible.\"",

    "The new ghost looked all over the town until at last he found a house that had no gods and no images of Buddha in it. Inside there was a room full of people enjoying a feast of fish, meat, vegetables and wine. When the new ghost saw their sumptuous meal, he was so tempted that he began to drool. He had to promptly think of what to do to get them to feed him. He saw a skinny little dog crouched by one of the legs of the table. The dog was wagging its tail in the hope that someone would throw him a bone. The ghost grabbed the dog and started to race around the room so it looked to the people as if the dog were flying.",

    "\"Look at that!\" someone exclaimed. \"How can that be?\" How can the day be flying around like that? Did someone cast a spell on him?\"",

    "The whole room fell into a commotion as the dog flew around and around. Somebody suggested that they call on Jesus to help them. Another person said, \"No, Jesus can help people change, but he cannot do anything when it comes to ghosts.\"",

    "Someone else said, \"Let us read Confucius's words out loud. Maybe he can help us!\"",

    "Another person answered, \"No! Have you forgotten that Confucius refused to talk about ghosts? He told us to keep away from them! He will not be able to help us, either!\"",

    "Things went on like this with people arguing back and forth for quite some time. At last they decided to call on a medium to exercise his magical power. ",

    "\"This ghost is bewitched. Let us kill the dog and prepare for him a table of food complete with three type of meat and wine. That will appease him!\"",

    "The people quickly did as instructed and prepared a bounteous feast for the ghost, who enjoyed every last bite of it. \"That was great!\" he said when he was finished. \"That was really good!\" The food was so good, in fact, the new ghosts never wanted to leave that house again. Every night after that he performed some new trick to get the people to make hime more food. So, this is truly the way to \"invite a ghost into your house.\"",

    "In life, people have to be careful to always treat others with kindness and to keep themselves well within the limits of good behavior. Definitely they should not ever invite a ghost into their home. Sometimes people fall in with bad company, with robbers or murders. If they ask that kind of person to help them even once, they will have a world of trouble on their hands. They may even lost their lives for it. In Taiwan, there are some really foolish customs in which people worship ghosts, rocks, trees, and practically everything. If people follow these customs and invite all these spirits and ghosts into their homes and honor them as special guests, they will be inviting disasters onto themselves. They should be careful to give their respect only to people who deserve it, to people who are honorable in their own lives. To ensure well-being and safety, one should maintain some distance from people who worship spirits and practice magic.",
  ].map((str,i)=>{
    //  return <div key={i} style={{width:window.innerWidth, textAlign: 'justify', flexWrap: 'wrap'}}><div style={{textIndent: 50, margin: 0}}>{parseItalic(str)}</div></div>
    // return <div key={i} style={{textIndent: 50, margin: 0, textAlign: 'justify'}}>{parseItalic(str)}</div>
    return <div key={i}>{parseItalic(str)}</div>
  })}
  </article>
</section>
)

const p4_en = (
<section>
  <article>
  {["In this universe, there are respective worlds for the then dharma realms (Buddhas, Bodhisattvas, Pratyekabuddhas, Sravakas, and the six realms mentioned earlier) There are the Buddhas' worlds such as the world of the Eastern Pure Land of Azure Radiance and that of the Western Pure Land of Ultimate Bliss. Heavenly beings have their worlds subdivided into three realms and twenty-eight heavens. We human beings have our world with the three oceans and five continents. Among human beings there are different faces with different body types. Some of us are rich and some poor, some are smart and some are a little slow. Animals, too, have their worlds; some of them fly in the air, others walk on the ground and still others swim in the ocean. In the same way, the ghosts in hell have many different ways of being. Ghosts live in a world somewhat like the one people live in. They have families, and they have to work to maintain themselves. Some of them are rich while others are poor. Their world, too, has disputes and grievances. Ghosts have many different sorts of characters; some to them are violent and cruel, but some of them are kind and good.",

"Ghosts and human beings actually live very close to the one another. Not all ghosts live in hell. They are right here with us, to the left and right of us. You do not have to travel to hell to find ghosts because ghosts are all over the place, right here in our world. What kinds of ghosts live in our world? Look around you. Everywhere you can see people who abuse drugs, waste themselves away in sexual indulgence, harm others, commit violent acts, rob, steal and murder. Are these people not worse than ghosts?  Are we not all tempted at times to be like ghosts ourselves, to withhold help when it is needed, to turn away when we see something wrong, to be suspicious, to speak badly about our friends, to be gluttonous and mean spirited when we know full well the right thing to do? It really is true that \"human ghosts\" can be much worse than the ghosts in hell.",

"When people think of ghosts, they usually only think of asking a monk to come to their homes and bless them, but they often do not think of blessing the \"ghosts\" of this world. When ghosts are blessed and delivered from suffering, all people can enjoy peace in their minds and in their dwellings. Likewise, when \"human ghosts\" are delivered, morality is elevated and society can become peaceful. How should people proceed to deliver those \"human ghosts\"? The Buddhist methods include taking refuge in the Triple Gem, upholding the Five Precepts, practicing the Six Perfections, and performing the Ten Virtues. Truly taking refuge in the Triple Gem can bring deliverance as follows: taking refuge in the Buddha means never falling int the hell realm; taking refuge in the Dharma means never falling into the animal realm; taking refuge in the Sangha means falling into the hungry ghost realm. If all would uphold the Five Precepts of Buddhism -- no killing, no stealing, no sexual indulgence, no harsh words and no drugs or alcohol -- humanity would be much farther from evil. People would no longer be planting new seeds of evil that one day might cause them to be reborn in the realm of hell or to become evil ghosts.",

  "In this modern world, evil is present all around. If everyone devotes themselves to promoting social values, to supporting education, to helping others and to raising the level of society's kindness, then all \"human ghosts\" would soon be freed from their sufferings.",

  "Hopefully through the efforts of all, society can be purged of ghosts and every person will become a moral and upright human being. Instead of thinking about ghosts, people should think about the Buddha. Instead of acting like ghosts, people should discover that Buddha nature inside them. Then this human realm will become like the Pure Land and no one will have to worry about hell anymore.",
  ].map((str,i)=>{
    //  return <div key={i} style={{width:window.innerWidth, textAlign: 'justify', flexWrap: 'wrap'}}><div style={{textIndent: 50, margin: 0}}>{parseItalic(str)}</div></div>
    // return <div key={i} style={{textIndent: 50, margin: 0, textAlign: 'justify'}}>{parseItalic(str)}</div>
    return <div key={i}>{parseItalic(str)}</div>
  })}
  </article>
</section>
)
module.exports = {
	 Home,
	 pages: [
	  {
        page: 0,
        contentText: {
            zh:c0('zh'),
            cn:c0('cn'),
            en: c0('en')
        }
    },
    {
        page: 1,
        contentText: {
            zh:a0('zh'),
            cn:a0('cn'),
            en: a0('en')
        }
    },
    {
        page: 2,
        contentText: {
            zh:intro_zh,
            cn:intro_cn,
            en: intro_en
        }
    },
	  {
        page: 3,
        contentText: {
            zh:p1,
            cn:p1_cn,
            en: p1_en
        }
    },
	  {
        page: 4,
        contentText: {
            zh:p2,
            cn:p2_cn,
            en: p2_en
        }
    },
	  {
        page: 5,
        contentText: {
            zh:p3,
            cn:p3_cn,
            en: p3_en
        }
    },
	  {
        page: 6,
        contentText: {
            zh:p4,
            cn:p4_cn,
            en: p4_en
        }
    }]
};
